{
    "J8ahqXjUhAAC": {
        "title": "Ready Player One",
        "author": [
            "Ernest Cline"
        ],
        "publisher": "Crown Pub",
        "publishedDate": "2011",
        "pages": 374,
        "rating": 4,
        "description": "Immersing himself in a mid-21st-century technological virtual utopia to escape an ugly real world of famine, poverty and disease, Wade Watts joins an increasingly violent effort to solve a series of puzzles by the virtual world's super-wealthy creator, who has promised that the winner will be his heir. (This book was previously listed in Forecast.)",
        "image": "http://books.google.com/books/content?id=J8ahqXjUhAAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://libgen.io/get.php?md5=7661fbc8dbe9c328ee916ffcaa1203b1",
        "epub": "http://libgen.io/get.php?md5=095812c4a3af9a861c72588c23cc41cc",
        "pdf": "http://libgen.io/get.php?md5=c170bc4cd68d31920b0ded1f68cd7fd8"
    },
    "efPjAAAAQBAJ": {
        "title": "V for Vendetta",
        "author": [
            "Alan Moore"
        ],
        "publisher": "DC",
        "publishedDate": "2008-10-24",
        "rating": 4,
        "description": "\"Alan Moore outdoes himself... Extraordinary ... a poetic celebration of the powers of the imagination.\" - Kurt Loder, MTV A powerful story about loss of freedom and individuality, V FOR VENDETTA takes place in a totalitarian England following a devastating war that changed the face of the planet. In a world without political freedom, personal freedom and precious little faith in anything, comes a mysterious man in a white porcelain mask who fights political oppressors through terrorism and seemingly absurd acts in this gripping tale of the blurred lines between ideological good and evil.",
        "image": "http://books.google.com/books/content?id=efPjAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=40ee6a87c7deb38c5379688b61a09c70",
        "_locals": {}
    },
    "wbtxzgAndU8C": {
        "title": "Web Site Measurement Hacks",
        "author": [
            "Eric Peterson"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2005-08-26",
        "pages": 405,
        "description": "Helps organizations and individual operators in making the most of their Web investment by providing tools, techniques, and strategies for measuring their site's overall effectiveness. Providing the definitions of commonly-used terms, this book teaches how to gather crucial marketing data, how to drive potential customers to action, and more.",
        "image": "http://books.google.com/books/content?id=wbtxzgAndU8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": false,
        "_locals": {}
    },
    "eASACwAAQBAJ": {
        "title": "Computer Vision for the Web",
        "author": [
            "Foat Akhmadeev"
        ],
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2015-10-14",
        "pages": 116,
        "description": "Unleash the power of the Computer Vision algorithms in JavaScript to develop vision-enabled web content About This Book Explore the exciting world of image processing, and face and gesture recognition, and implement them in your website Develop wonderful web projects to implement Computer Vision algorithms in an effective way A fast-paced guide to help you deal with real-world Computer Vision applications using JavaScript libraries Who This Book Is For If you have an interest in Computer Vision or wish to apply Computer Vision algorithms such as face, custom object, and gesture recognition for an online application, then this book is ideal for you. Prior understanding of the JavaScript language and core mathematical concepts is recommended. What You Will Learn Apply complex Computer Vision algorithms in your applications using JavaScript Put together different JavaScript libraries to discover objects in photos Get to grips with developing simple computer vision applications on your own Understand when and why you should use different computer vision methods Apply various image filters to images and videos Recognize and track many different objects, including face and face particles using powerful face recognition algorithms Explore ways to control your browser without touching the mouse or keyboard In Detail JavaScript is a dynamic and prototype-based programming language supported by every browser today. JavaScript libraries boast outstanding functionalities that enable you to furnish your own Computer Vision projects, making it easier to develop JavaScript–based applications, especially for web-centric technologies. It makes the implementation of Computer Vision algorithms easier as it supports scheme-based functional programming. This book will give you an insight into controlling your applications with gestures and head motion and readying them for the web. Packed with real-world tasks, it begins with a walkthrough of the basic concepts of Computer Vision that the JavaScript world offers us, and you'll implement various powerful algorithms in your own online application. Then, we move on to a comprehensive analysis of JavaScript functions and their applications. Furthermore, the book will show you how to implement filters and image segmentation, and use tracking.js and jsfeat libraries to convert your browser into Photoshop. Subjects such as object and custom detection, feature extraction, and object matching are covered to help you find an object in a photo. You will see how a complex object such as a face can be recognized by a browser as you move toward the end of the book. Finally, you will focus on algorithms to create a human interface. By the end of this book, you will be familiarized with the application of complex Computer Vision algorithms to develop your own applications, without spending much time learning sophisticated theory. Style and approach This book is an easy-to-follow project-based guide that throws you directly into the excitement of the Computer Vision theme. A “more in less” approach is followed by important concepts explained in a to-the-point, easy-to-understand manner.",
        "image": "http://books.google.com/books/content?id=eASACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://libgen.io/get.php?md5=867bff4b279097a7ebc163cc49b2fb41",
        "pdf": false
    },
    "wIgSDQAAQBAJ": {
        "title": "Computer Security – ESORICS 2016",
        "author": [
            "Ioannis Askoxylakis",
            "Sotiris Ioannidis",
            "Sokratis Katsikas",
            "Catherine Meadows"
        ],
        "publisher": "Springer",
        "publishedDate": "2016-09-14",
        "pages": 623,
        "description": "The two-volume set, LNCS 9878 and 9879 constitutes the refereed proceedings of the 21st European Symposium on Research in Computer Security, ESORICS 2016, held in Heraklion, Greece, in September 2016. The 60 revised full papers presented were carefully reviewed and selected from 285 submissions. The papers cover a wide range of topics in security and privacy, including data protection: systems security, network security, access control, authentication, and security in such emerging areas as cloud computing, cyber-physical systems, and the Internet of Things.",
        "image": "http://books.google.com/books/content?id=wIgSDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=94acd2272776f781dae78396ee691074"
    },
    "KzzXzqLzXi8C": {
        "title": "SEO Warrior",
        "author": [
            "John I Jerkovic"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2009-11-09",
        "pages": 496,
        "rating": 5,
        "description": "How can you make it easier for people to find your website? And how can you convert casual visitors into active users? SEO Warrior shows you how it's done through a collection of tried and true techniques, hacks, and best practices. Learn the nuts and bolts of search engine optimization (SEO) theory, the importance of keyword strategy, and how to avoid and remedy search engine traps. You'll also learn about search engine marketing (SEM) practices, such as Google AdWords, and how you can use social networking to increase your visibility. Ideal for web developers, savvy marketers, webmasters, and anyone else interested in SEO, this book serves not only as an SEO tutorial, but also as a reference for implementing effective SEO techniques. Create compelling sites with SEO that can stand the test of time Optimize your site for Google, Yahoo!, Microsoft's Bing, as well as search engines used in different parts of the world Conduct keyword research to find the best terms to reach your audience--and the related terms they'll respond to Learn what makes search engines tick by utilizing custom scripts Analyze your site to see how it measures up to the competition",
        "image": "http://books.google.com/books/content?id=KzzXzqLzXi8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=fc32e35f0dbb2d6d6e19df7b1b6b8947"
    },
    "CNvRtnZUPI8C": {
        "title": "Big Book of Windows Hacks",
        "author": [
            "Preston Gralla"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2007",
        "pages": 647,
        "rating": 4.5,
        "description": "Provides more than two hundred tips on ways to modify the Windows XP and Vista operating system, applications, and hardware associated with it.",
        "image": "http://books.google.com/books/content?id=CNvRtnZUPI8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=39a601d66b039519cd4de71b839357e6"
    },
    "bdf4vS2n7N8C": {
        "title": "Web Design in a Nutshell",
        "author": [
            "Jennifer Niederst Robbins"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2006-02-21",
        "pages": 830,
        "rating": 4,
        "description": "Are you still designing web sites like it's 1999? If so, you're in for a surprise. Since the last edition of this book appeared five years ago, there has been a major climate change with regard to web standards. Designers are no longer using (X)HTML as a design tool, but as a means of defining the meaning and structure of content. Cascading Style Sheets are no longer just something interesting to tinker with, but rather a reliable method for handling all matters of presentation, from fonts and colors to the layout of the entire page. In fact, following the standards is now a mandate of professional web design. Our popular reference, Web Design in a Nutshell, is one of the first books to capture this new web landscape with an edition that's been completely rewritten and expanded to reflect the state of the art. In addition to being an authoritative reference for (X)HTML and Cascading Style Sheets, this book also provides an overview of the unique requirements of designing for the Web and gets to the nitty-gritty of JavaScript and DOM Scripting, web graphics optimization, and multimedia production. It is an indispensable tool for web designers and developers of all levels. The third edition covers these contemporary web design topics: Structural layer: HTML 4.01 and XHTML 1.0 (9 chapters), including an alphabetical reference of all elements, attributes and character entities Presentation layer: Ten all-new chapters on Cascading Style Sheets, Level 2.1, including an alphabetical reference of all properties and values. Behavior layer: JavaScript and scripting with the Document Object Model (DOM) Web environment: New web standards, browsers, display devices, accessibility, and internationalization Web graphics optimization: Producing lean and mean GIF, JPEG, PNG, and animated GIFs Multimedia: Web audio, video, Flash, and PDF Organized so that readers can find answers quickly, Web Design in a Nutshell, Third Edition helps experienced designers come up to speed quickly on standards-based web design, and serves as a quick reference for those already familiar with the new standards and technology. There are many books for web designers, but none that address such a wide variety of topics. Find out why nearly half a million buyers have made this the most popular web design book available.",
        "image": "http://books.google.com/books/content?id=bdf4vS2n7N8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=712a01013025244341798180036e304f"
    },
    "e8SgPwAACAAJ": {
        "title": "The 22 Immutable Laws of Marketing",
        "author": [
            "Al Ries",
            "Jack Trout"
        ],
        "publisher": "Profile Books(GB)",
        "publishedDate": "1994",
        "pages": 160,
        "rating": 5,
        "description": "Ries and Trout share their rules for certain successes in the world of marketing. Combining a wide-ranging historical overview with a keen eye for the future, the authors bring to light 22 superlative tools and innovative techniques for the international marketplace.",
        "image": "http://books.google.com/books/content?id=e8SgPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=2764b73715bbed39e142271cdcbd58bb"
    },
    "TM8zvgAACAAJ": {
        "title": "The Internet of Money",
        "author": [
            "Andreas M. Antonopoulos"
        ],
        "publisher": "Createspace Independent Publishing Platform",
        "publishedDate": "2016-08-30",
        "pages": 148,
        "rating": 4,
        "description": "While many books explain the how of bitcoin, The Internet of Money delves into the why of bitcoin. Acclaimed information-security expert and author of Mastering Bitcoin, Andreas M. Antonopoulos examines and contextualizes the significance of bitcoin through a series of essays spanning the exhilarating maturation of this technology. Bitcoin, a technological breakthrough quietly introduced to the world in 2008, is transforming much more than finance. Bitcoin is disrupting antiquated industries to bring financial independence to billions worldwide. In this book, Andreas explains why bitcoin is a financial and technological evolution with potential far exceeding the label -digital currency.- Andreas goes beyond exploring the technical functioning of the bitcoin network by illuminating bitcoin's philosophical, social, and historical implications. As the internet has essentially transformed how people around the world interact and has permanently impacted our lives in ways we never could have imagined, bitcoin--the internet of money--is fundamentally changing our approach to solving social, political, and economic problems through decentralized technology.",
        "image": "http://books.google.com/books/content?id=TM8zvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": "http://libgen.io/get.php?md5=5b99b7814224da87cb9a10d527c6228e",
        "pdf": false
    },
    "VznTCwAAQBAJ": {
        "title": "The Book Thief",
        "author": [
            "Markus Zusak"
        ],
        "publisher": "Knopf Books for Young Readers",
        "publishedDate": "2016-03-08",
        "pages": 592,
        "rating": 4.5,
        "description": "Trying to make sense of the horrors of World War II, Death relates the story of Liesel--a young German girl whose book-stealing and story-telling talents help sustain her family and the Jewish man they are hiding, as well as their neighbors.",
        "image": "http://books.google.com/books/content?id=VznTCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=3845a826b57cb57d107303abc6348786",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=a53f9968b27c6189e3abb29ed858348b"
    },
    "7papZR4oVssC": {
        "title": "\"Surely You're Joking, Mr. Feynman!\": Adventures of a Curious Character",
        "author": [
            "Richard P. Feynman"
        ],
        "publisher": "W. W. Norton & Company",
        "publishedDate": "2010-06-28",
        "pages": 352,
        "rating": 4,
        "description": "A New York Times bestseller—the outrageous exploits of one of this century's greatest scientific minds and a legendary American original. Richard Feynman, winner of the Nobel Prize in physics, thrived on outrageous adventures. Here he recounts in his inimitable voice his experience trading ideas on atomic physics with Einstein and Bohr and ideas on gambling with Nick the Greek; cracking the uncrackable safes guarding the most deeply held nuclear secrets; accompanying a ballet on his bongo drums; painting a naked female toreador. In short, here is Feynman's life in all its eccentric—a combustible mixture of high intelligence, unlimited curiosity, and raging chutzpah.",
        "image": "http://books.google.com/books/content?id=7papZR4oVssC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=c92b3aa24e66c154fa8c99879c005e80",
        "epub": "http://gen.lib.rus.ec/get.php?md5=bd6202162337eb9f26930a955967d83f",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=3e123f74a524f71a99351cfe20124a65"
    },
    "_CWlKRYLbIwC": {
        "title": "A Short History of Nearly Everything",
        "author": [
            "Bill Bryson"
        ],
        "publisher": "Anchor Canada",
        "publishedDate": "2012-05-15",
        "pages": 560,
        "rating": 4,
        "description": "One of the world’s most beloved and bestselling writers takes his ultimate journey -- into the most intriguing and intractable questions that science seeks to answer. In A Walk in the Woods, Bill Bryson trekked the Appalachian Trail -- well, most of it. In In A Sunburned Country, he confronted some of the most lethal wildlife Australia has to offer. Now, in his biggest book, he confronts his greatest challenge: to understand -- and, if possible, answer -- the oldest, biggest questions we have posed about the universe and ourselves. Taking as territory everything from the Big Bang to the rise of civilization, Bryson seeks to understand how we got from there being nothing at all to there being us. To that end, he has attached himself to a host of the world’s most advanced (and often obsessed) archaeologists, anthropologists, and mathematicians, travelling to their offices, laboratories, and field camps. He has read (or tried to read) their books, pestered them with questions, apprenticed himself to their powerful minds. A Short History of Nearly Everything is the record of this quest, and it is a sometimes profound, sometimes funny, and always supremely clear and entertaining adventure in the realms of human knowledge, as only Bill Bryson can render it. Science has never been more involving or entertaining. From the Hardcover edition.",
        "image": "http://books.google.com/books/content?id=_CWlKRYLbIwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=9fff3cd143688bb899c4e3c3506c3bd5",
        "epub": "http://gen.lib.rus.ec/get.php?md5=adc4514330236b862772900cc1a0d6ab",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=52fec8e9776901cabec19b66cfb540fe"
    },
    "yBYmAAAAMAAJ": {
        "title": "The Adventures of Tom Sawyer",
        "author": [
            "Mark Twain"
        ],
        "publishedDate": "1881",
        "pages": 274,
        "rating": 4,
        "image": "http://books.google.com/books/content?id=yBYmAAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=cf8edfb26fde6292eb7f783e508d06dd"
    },
    "ilRoAwAAQBAJ": {
        "title": "Frankenstein",
        "author": [
            "Mary Shelley"
        ],
        "publisher": "BookRix",
        "publishedDate": "2017-05-22",
        "pages": 301,
        "rating": 4,
        "description": "Frankenstein is a novel written by British author Mary Shelley about eccentric scientist Victor Frankenstein, who creates a grotesque creature in an unorthodox scientific experiment. Frankenstein is infused with some elements of the Gothic novel and the Romantic movement and is also considered to be one of the earliest examples of science fiction. Brian Aldiss has argued that it should be considered the first true science fiction story, because unlike in previous stories with fantastical elements resembling those of later science fiction, the central character \"makes a deliberate decision\" and \"turns to modern experiments in the laboratory\" to achieve fantastic results. It has had a considerable influence across literature and popular culture and spawned a complete genre of horror stories, films, and plays. Since publication of the novel, the name \"Frankenstein\" is often used to refer to the monster itself. This usage is sometimes considered erroneous, but usage commentators regard the monster sense of \"Frankenstein\" as well-established and an acceptable usage. In the novel, the monster is identified via words such as \"creature\", \"monster\", \"fiend\", \"wretch\", \"vile insect\", \"daemon\", \"being\", and \"it\". Speaking to Victor Frankenstein, the monster refers to himself as \"the Adam of your labors\", and elsewhere as someone who \"would have\" been \"your Adam\", but is instead \"your fallen angel.\"",
        "image": "http://books.google.com/books/content?id=ilRoAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=bfc01601daec13753f0b479c01169d37"
    },
    "x7vaDgAAQBAJ": {
        "title": "Einstein",
        "author": [
            "Walter Isaacson"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2008-05-13",
        "pages": 704,
        "rating": 4,
        "description": "A narrative portrait based on the complete body of Einstein's papers offers insight into his contributions to science, in an account that describes the influence of his discoveries on his personal views about morality, politics, and tolerance.",
        "image": "http://books.google.com/books/content?id=x7vaDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=0bcedfa53edc357d0c757b64e533909a",
        "epub": "http://gen.lib.rus.ec/get.php?md5=5fdeaba0c1d3dd537a1990f21f0f26a6",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=4deaba9a040d85db421107b3c887ca5f"
    },
    "qEoOl9bcV_cC": {
        "title": "Jane Eyre",
        "author": [
            "Charlotte Brontë"
        ],
        "publishedDate": "1890",
        "rating": 4,
        "image": "http://books.google.com/books/content?id=JuA0AAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=ce8b6db8a92de853fcacd452e835d62f",
        "_locals": {}
    },
    "JuA0AAAAMAAJ": {
        "title": "Jane Eyre",
        "author": [
            "Charlotte Brontë"
        ],
        "publishedDate": "1890",
        "rating": 4,
        "image": "http://books.google.com/books/content?id=JuA0AAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=ce8b6db8a92de853fcacd452e835d62f",
        "_locals": {}
    },
    "E7mEnx3zE4AC": {
        "title": "A Brief History of Time",
        "author": [
            "Stephen W. Hawking"
        ],
        "publisher": "Random House of Canada",
        "publishedDate": "1998",
        "pages": 212,
        "rating": 4,
        "description": "An anniversary edition of a now-classic survey of the origin and nature of the universe features a new introduction by the author and a new chapter on the possibility of time travel and \"wormholes\" in space",
        "image": "http://books.google.com/books/content?id=E7mEnx3zE4AC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=e36f033611cb270650e06437b4994902",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=44f20116d682817619c770fcdbf66123"
    },
    "YuLuAn3itnAC": {
        "title": "The Sirens of Titan",
        "author": [
            "Kurt Vonnegut"
        ],
        "publisher": "Dial Press",
        "publishedDate": "2007-12-18",
        "pages": 336,
        "rating": 4,
        "description": "The Sirens of Titan is an outrageous romp through space, time, and morality. The richest, most depraved man on Earth, Malachi Constant, is offered a chance to take a space journey to distant worlds with a beautiful woman at his side. Of course there’s a catch to the invitation–and a prophetic vision about the purpose of human life that only Vonnegut has the courage to tell. From the Trade Paperback edition.",
        "image": "http://books.google.com/books/content?id=YuLuAn3itnAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=74642a67f322d22a3697c24b0e790a4a",
        "epub": "http://gen.lib.rus.ec/get.php?md5=3834cc0b0ccda43fa5286363691dbc4f",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=b3283218d9f42ec13374dbede608876d"
    },
    "8iwrxNgYaDsC": {
        "title": "Anathem",
        "author": [
            "Neal Stephenson"
        ],
        "publisher": "Harper Collins",
        "publishedDate": "2009-10-06",
        "pages": 1008,
        "rating": 4,
        "description": "A #1 New York Times Bestseller, Anathem is perhaps the most brilliant literary invention to date from the incomparable Neal Stephenson, who rocked the world with Snow Crash, Cryptonomicon, and The Baroque Cycle. Now he imagines an alternate universe where scientists, philosophers, and mathematicians live in seclusion behind ancient monastery walls until they are called back into the world to deal with a crisis of astronomical proportions. Anathem won the Locus Award for Best Science Fiction Novel and the reviews for have been dazzling: “Brilliant” (South Florida Sun-Sentinel), “Daring” (Boston Globe), “Immensely entertaining” (New York Times Book Review), “A tour de force” (St. Louis Post-Dispatch), while Time magazine proclaims, “The great novel of ideas…has morphed into science fiction, and Neal Stephenson is its foremost practitioner.”",
        "image": "http://books.google.com/books/content?id=8iwrxNgYaDsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=c2ab0a2c084b4c17bccb100b21041a3a",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=9bea35dead19a161ef426b5a5b3bd3d2"
    },
    "z9Q99X-OOtAC": {
        "title": "The Secret",
        "author": [
            "Rhonda Byrne"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2011-07-07",
        "pages": 216,
        "rating": 3,
        "description": "The tenth-anniversary edition of the book that changed lives in profound ways, now with a new foreword and afterword. In 2006, a groundbreaking feature-length film revealed the great mystery of the universe—The Secret—and, later that year, Rhonda Byrne followed with a book that became a worldwide bestseller. Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you’ll learn how to use The Secret in every aspect of your life—money, health, relationships, happiness, and in every interaction you have in the world. You’ll begin to understand the hidden, untapped power that’s within you, and this revelation can bring joy to every aspect of your life. The Secret contains wisdom from modern-day teachers—men and women who have used it to achieve health, wealth, and happiness. By applying the knowledge of The Secret, they bring to light compelling stories of eradicating disease, acquiring massive wealth, overcoming obstacles, and achieving what many would regard as impossible.",
        "image": "http://books.google.com/books/content?id=z9Q99X-OOtAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=b11b7dd1c96f2ff67a6504e48d2eda17"
    },
    "fH_ptQ6LoQEC": {
        "title": "Cloud Atlas",
        "author": [
            "David Mitchell"
        ],
        "publisher": "Vintage Canada",
        "publishedDate": "2010-07-16",
        "pages": 528,
        "rating": 4,
        "description": "By the New York Times bestselling author of The Bone Clocks | Shortlisted for the Man Booker Prize A postmodern visionary and one of the leading voices in twenty-first-century fiction, David Mitchell combines flat-out adventure, a Nabokovian love of puzzles, a keen eye for character, and a taste for mind-bending, philosophical and scientific speculation in the tradition of Umberto Eco, Haruki Murakami, and Philip K. Dick. The result is brilliantly original fiction as profound as it is playful. In this groundbreaking novel, an influential favorite among a new generation of writers, Mitchell explores with daring artistry fundamental questions of reality and identity. Cloud Atlas begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . . Abruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history. But the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky. As wild as a videogame, as mysterious as a Zen koan, Cloud Atlas is an unforgettable tour de force that, like its incomparable author, has transcended its cult classic status to become a worldwide phenomenon. Praise for Cloud Atlas “[David] Mitchell is, clearly, a genius. He writes as though at the helm of some perpetual dream machine, can evidently do anything, and his ambition is written in magma across this novel’s every page.”—The New York Times Book Review “One of those how-the-holy-hell-did-he-do-it? modern classics that no doubt is—and should be—read by any student of contemporary literature.”—Dave Eggers “Wildly entertaining . . . a head rush, both action-packed and chillingly ruminative.”—People “The novel as series of nested dolls or Chinese boxes, a puzzle-book, and yet—not just dazzling, amusing, or clever but heartbreaking and passionate, too. I’ve never read anything quite like it, and I’m grateful to have lived, for a while, in all its many worlds.”—Michael Chabon “Cloud Atlas ought to make [Mitchell] famous on both sides of the Atlantic as a writer whose fearlessness is matched by his talent.”—The Washington Post Book World “Thrilling . . . One of the biggest joys in Cloud Atlas is watching Mitchell sashay from genre to genre without a hitch in his dance step.”—Boston Sunday Globe “Grand and elaborate . . . [Mitchell] creates a world and language at once foreign and strange, yet strikingly familiar and intimate.”—Los Angeles Times From the Hardcover edition.",
        "image": "http://books.google.com/books/content?id=EoxXLiC0uAIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=bb0565c8903dc6190a8f5542dd8861d4",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=1921db45ae015fadb6c88c05c5a1c760",
        "_locals": {}
    },
    "EoxXLiC0uAIC": {
        "title": "Cloud Atlas",
        "author": [
            "David Mitchell"
        ],
        "publisher": "Vintage Canada",
        "publishedDate": "2010-07-16",
        "pages": 528,
        "rating": 4,
        "description": "By the New York Times bestselling author of The Bone Clocks | Shortlisted for the Man Booker Prize A postmodern visionary and one of the leading voices in twenty-first-century fiction, David Mitchell combines flat-out adventure, a Nabokovian love of puzzles, a keen eye for character, and a taste for mind-bending, philosophical and scientific speculation in the tradition of Umberto Eco, Haruki Murakami, and Philip K. Dick. The result is brilliantly original fiction as profound as it is playful. In this groundbreaking novel, an influential favorite among a new generation of writers, Mitchell explores with daring artistry fundamental questions of reality and identity. Cloud Atlas begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . . Abruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history. But the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky. As wild as a videogame, as mysterious as a Zen koan, Cloud Atlas is an unforgettable tour de force that, like its incomparable author, has transcended its cult classic status to become a worldwide phenomenon. Praise for Cloud Atlas “[David] Mitchell is, clearly, a genius. He writes as though at the helm of some perpetual dream machine, can evidently do anything, and his ambition is written in magma across this novel’s every page.”—The New York Times Book Review “One of those how-the-holy-hell-did-he-do-it? modern classics that no doubt is—and should be—read by any student of contemporary literature.”—Dave Eggers “Wildly entertaining . . . a head rush, both action-packed and chillingly ruminative.”—People “The novel as series of nested dolls or Chinese boxes, a puzzle-book, and yet—not just dazzling, amusing, or clever but heartbreaking and passionate, too. I’ve never read anything quite like it, and I’m grateful to have lived, for a while, in all its many worlds.”—Michael Chabon “Cloud Atlas ought to make [Mitchell] famous on both sides of the Atlantic as a writer whose fearlessness is matched by his talent.”—The Washington Post Book World “Thrilling . . . One of the biggest joys in Cloud Atlas is watching Mitchell sashay from genre to genre without a hitch in his dance step.”—Boston Sunday Globe “Grand and elaborate . . . [Mitchell] creates a world and language at once foreign and strange, yet strikingly familiar and intimate.”—Los Angeles Times From the Hardcover edition.",
        "image": "http://books.google.com/books/content?id=EoxXLiC0uAIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=bb0565c8903dc6190a8f5542dd8861d4",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=1921db45ae015fadb6c88c05c5a1c760",
        "_locals": {}
    }
}