{
    "J8ahqXjUhAAC": {
        "title": "Ready Player One",
        "author": [
            "Ernest Cline"
        ],
        "publisher": "Crown Pub",
        "publishedDate": "2011",
        "pages": 374,
        "rating": 4,
        "description": "Immersing himself in a mid-21st-century technological virtual utopia to escape an ugly real world of famine, poverty and disease, Wade Watts joins an increasingly violent effort to solve a series of puzzles by the virtual world's super-wealthy creator, who has promised that the winner will be his heir. (This book was previously listed in Forecast.)",
        "image": "http://books.google.com/books/content?id=J8ahqXjUhAAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://libgen.io/get.php?md5=7661fbc8dbe9c328ee916ffcaa1203b1",
        "epub": "http://libgen.io/get.php?md5=095812c4a3af9a861c72588c23cc41cc",
        "pdf": "http://libgen.io/get.php?md5=c170bc4cd68d31920b0ded1f68cd7fd8"
    },
    "efPjAAAAQBAJ": {
        "title": "V for Vendetta",
        "author": [
            "Alan Moore"
        ],
        "publisher": "DC",
        "publishedDate": "2008-10-24",
        "rating": 4,
        "description": "\"Alan Moore outdoes himself... Extraordinary ... a poetic celebration of the powers of the imagination.\" - Kurt Loder, MTV A powerful story about loss of freedom and individuality, V FOR VENDETTA takes place in a totalitarian England following a devastating war that changed the face of the planet. In a world without political freedom, personal freedom and precious little faith in anything, comes a mysterious man in a white porcelain mask who fights political oppressors through terrorism and seemingly absurd acts in this gripping tale of the blurred lines between ideological good and evil.",
        "image": "http://books.google.com/books/content?id=efPjAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=40ee6a87c7deb38c5379688b61a09c70",
        "_locals": {}
    },
    "wbtxzgAndU8C": {
        "title": "Web Site Measurement Hacks",
        "author": [
            "Eric Peterson"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2005-08-26",
        "pages": 405,
        "description": "Helps organizations and individual operators in making the most of their Web investment by providing tools, techniques, and strategies for measuring their site's overall effectiveness. Providing the definitions of commonly-used terms, this book teaches how to gather crucial marketing data, how to drive potential customers to action, and more.",
        "image": "http://books.google.com/books/content?id=wbtxzgAndU8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": false,
        "_locals": {}
    },
    "eASACwAAQBAJ": {
        "title": "Computer Vision for the Web",
        "author": [
            "Foat Akhmadeev"
        ],
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2015-10-14",
        "pages": 116,
        "description": "Unleash the power of the Computer Vision algorithms in JavaScript to develop vision-enabled web content About This Book Explore the exciting world of image processing, and face and gesture recognition, and implement them in your website Develop wonderful web projects to implement Computer Vision algorithms in an effective way A fast-paced guide to help you deal with real-world Computer Vision applications using JavaScript libraries Who This Book Is For If you have an interest in Computer Vision or wish to apply Computer Vision algorithms such as face, custom object, and gesture recognition for an online application, then this book is ideal for you. Prior understanding of the JavaScript language and core mathematical concepts is recommended. What You Will Learn Apply complex Computer Vision algorithms in your applications using JavaScript Put together different JavaScript libraries to discover objects in photos Get to grips with developing simple computer vision applications on your own Understand when and why you should use different computer vision methods Apply various image filters to images and videos Recognize and track many different objects, including face and face particles using powerful face recognition algorithms Explore ways to control your browser without touching the mouse or keyboard In Detail JavaScript is a dynamic and prototype-based programming language supported by every browser today. JavaScript libraries boast outstanding functionalities that enable you to furnish your own Computer Vision projects, making it easier to develop JavaScript–based applications, especially for web-centric technologies. It makes the implementation of Computer Vision algorithms easier as it supports scheme-based functional programming. This book will give you an insight into controlling your applications with gestures and head motion and readying them for the web. Packed with real-world tasks, it begins with a walkthrough of the basic concepts of Computer Vision that the JavaScript world offers us, and you'll implement various powerful algorithms in your own online application. Then, we move on to a comprehensive analysis of JavaScript functions and their applications. Furthermore, the book will show you how to implement filters and image segmentation, and use tracking.js and jsfeat libraries to convert your browser into Photoshop. Subjects such as object and custom detection, feature extraction, and object matching are covered to help you find an object in a photo. You will see how a complex object such as a face can be recognized by a browser as you move toward the end of the book. Finally, you will focus on algorithms to create a human interface. By the end of this book, you will be familiarized with the application of complex Computer Vision algorithms to develop your own applications, without spending much time learning sophisticated theory. Style and approach This book is an easy-to-follow project-based guide that throws you directly into the excitement of the Computer Vision theme. A “more in less” approach is followed by important concepts explained in a to-the-point, easy-to-understand manner.",
        "image": "http://books.google.com/books/content?id=eASACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://libgen.io/get.php?md5=867bff4b279097a7ebc163cc49b2fb41",
        "pdf": false
    },
    "wIgSDQAAQBAJ": {
        "title": "Computer Security – ESORICS 2016",
        "author": [
            "Ioannis Askoxylakis",
            "Sotiris Ioannidis",
            "Sokratis Katsikas",
            "Catherine Meadows"
        ],
        "publisher": "Springer",
        "publishedDate": "2016-09-14",
        "pages": 623,
        "description": "The two-volume set, LNCS 9878 and 9879 constitutes the refereed proceedings of the 21st European Symposium on Research in Computer Security, ESORICS 2016, held in Heraklion, Greece, in September 2016. The 60 revised full papers presented were carefully reviewed and selected from 285 submissions. The papers cover a wide range of topics in security and privacy, including data protection: systems security, network security, access control, authentication, and security in such emerging areas as cloud computing, cyber-physical systems, and the Internet of Things.",
        "image": "http://books.google.com/books/content?id=wIgSDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=94acd2272776f781dae78396ee691074"
    },
    "KzzXzqLzXi8C": {
        "title": "SEO Warrior",
        "author": [
            "John I Jerkovic"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2009-11-09",
        "pages": 496,
        "rating": 5,
        "description": "How can you make it easier for people to find your website? And how can you convert casual visitors into active users? SEO Warrior shows you how it's done through a collection of tried and true techniques, hacks, and best practices. Learn the nuts and bolts of search engine optimization (SEO) theory, the importance of keyword strategy, and how to avoid and remedy search engine traps. You'll also learn about search engine marketing (SEM) practices, such as Google AdWords, and how you can use social networking to increase your visibility. Ideal for web developers, savvy marketers, webmasters, and anyone else interested in SEO, this book serves not only as an SEO tutorial, but also as a reference for implementing effective SEO techniques. Create compelling sites with SEO that can stand the test of time Optimize your site for Google, Yahoo!, Microsoft's Bing, as well as search engines used in different parts of the world Conduct keyword research to find the best terms to reach your audience--and the related terms they'll respond to Learn what makes search engines tick by utilizing custom scripts Analyze your site to see how it measures up to the competition",
        "image": "http://books.google.com/books/content?id=KzzXzqLzXi8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=fc32e35f0dbb2d6d6e19df7b1b6b8947"
    },
    "CNvRtnZUPI8C": {
        "title": "Big Book of Windows Hacks",
        "author": [
            "Preston Gralla"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2007",
        "pages": 647,
        "rating": 4.5,
        "description": "Provides more than two hundred tips on ways to modify the Windows XP and Vista operating system, applications, and hardware associated with it.",
        "image": "http://books.google.com/books/content?id=CNvRtnZUPI8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=39a601d66b039519cd4de71b839357e6"
    },
    "bdf4vS2n7N8C": {
        "title": "Web Design in a Nutshell",
        "author": [
            "Jennifer Niederst Robbins"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2006-02-21",
        "pages": 830,
        "rating": 4,
        "description": "Are you still designing web sites like it's 1999? If so, you're in for a surprise. Since the last edition of this book appeared five years ago, there has been a major climate change with regard to web standards. Designers are no longer using (X)HTML as a design tool, but as a means of defining the meaning and structure of content. Cascading Style Sheets are no longer just something interesting to tinker with, but rather a reliable method for handling all matters of presentation, from fonts and colors to the layout of the entire page. In fact, following the standards is now a mandate of professional web design. Our popular reference, Web Design in a Nutshell, is one of the first books to capture this new web landscape with an edition that's been completely rewritten and expanded to reflect the state of the art. In addition to being an authoritative reference for (X)HTML and Cascading Style Sheets, this book also provides an overview of the unique requirements of designing for the Web and gets to the nitty-gritty of JavaScript and DOM Scripting, web graphics optimization, and multimedia production. It is an indispensable tool for web designers and developers of all levels. The third edition covers these contemporary web design topics: Structural layer: HTML 4.01 and XHTML 1.0 (9 chapters), including an alphabetical reference of all elements, attributes and character entities Presentation layer: Ten all-new chapters on Cascading Style Sheets, Level 2.1, including an alphabetical reference of all properties and values. Behavior layer: JavaScript and scripting with the Document Object Model (DOM) Web environment: New web standards, browsers, display devices, accessibility, and internationalization Web graphics optimization: Producing lean and mean GIF, JPEG, PNG, and animated GIFs Multimedia: Web audio, video, Flash, and PDF Organized so that readers can find answers quickly, Web Design in a Nutshell, Third Edition helps experienced designers come up to speed quickly on standards-based web design, and serves as a quick reference for those already familiar with the new standards and technology. There are many books for web designers, but none that address such a wide variety of topics. Find out why nearly half a million buyers have made this the most popular web design book available.",
        "image": "http://books.google.com/books/content?id=bdf4vS2n7N8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=712a01013025244341798180036e304f"
    },
    "e8SgPwAACAAJ": {
        "title": "The 22 Immutable Laws of Marketing",
        "author": [
            "Al Ries",
            "Jack Trout"
        ],
        "publisher": "Profile Books(GB)",
        "publishedDate": "1994",
        "pages": 160,
        "rating": 5,
        "description": "Ries and Trout share their rules for certain successes in the world of marketing. Combining a wide-ranging historical overview with a keen eye for the future, the authors bring to light 22 superlative tools and innovative techniques for the international marketplace.",
        "image": "http://books.google.com/books/content?id=e8SgPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=2764b73715bbed39e142271cdcbd58bb"
    },
    "TM8zvgAACAAJ": {
        "title": "The Internet of Money",
        "author": [
            "Andreas M. Antonopoulos"
        ],
        "publisher": "Createspace Independent Publishing Platform",
        "publishedDate": "2016-08-30",
        "pages": 148,
        "rating": 4,
        "description": "While many books explain the how of bitcoin, The Internet of Money delves into the why of bitcoin. Acclaimed information-security expert and author of Mastering Bitcoin, Andreas M. Antonopoulos examines and contextualizes the significance of bitcoin through a series of essays spanning the exhilarating maturation of this technology. Bitcoin, a technological breakthrough quietly introduced to the world in 2008, is transforming much more than finance. Bitcoin is disrupting antiquated industries to bring financial independence to billions worldwide. In this book, Andreas explains why bitcoin is a financial and technological evolution with potential far exceeding the label -digital currency.- Andreas goes beyond exploring the technical functioning of the bitcoin network by illuminating bitcoin's philosophical, social, and historical implications. As the internet has essentially transformed how people around the world interact and has permanently impacted our lives in ways we never could have imagined, bitcoin--the internet of money--is fundamentally changing our approach to solving social, political, and economic problems through decentralized technology.",
        "image": "http://books.google.com/books/content?id=TM8zvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": "http://libgen.io/get.php?md5=5b99b7814224da87cb9a10d527c6228e",
        "pdf": false
    },
    "VznTCwAAQBAJ": {
        "title": "The Book Thief",
        "author": [
            "Markus Zusak"
        ],
        "publisher": "Knopf Books for Young Readers",
        "publishedDate": "2016-03-08",
        "pages": 592,
        "rating": 4.5,
        "description": "Trying to make sense of the horrors of World War II, Death relates the story of Liesel--a young German girl whose book-stealing and story-telling talents help sustain her family and the Jewish man they are hiding, as well as their neighbors.",
        "image": "http://books.google.com/books/content?id=VznTCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=3845a826b57cb57d107303abc6348786",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=a53f9968b27c6189e3abb29ed858348b"
    },
    "7papZR4oVssC": {
        "title": "\"Surely You're Joking, Mr. Feynman!\": Adventures of a Curious Character",
        "author": [
            "Richard P. Feynman"
        ],
        "publisher": "W. W. Norton & Company",
        "publishedDate": "2010-06-28",
        "pages": 352,
        "rating": 4,
        "description": "A New York Times bestseller—the outrageous exploits of one of this century's greatest scientific minds and a legendary American original. Richard Feynman, winner of the Nobel Prize in physics, thrived on outrageous adventures. Here he recounts in his inimitable voice his experience trading ideas on atomic physics with Einstein and Bohr and ideas on gambling with Nick the Greek; cracking the uncrackable safes guarding the most deeply held nuclear secrets; accompanying a ballet on his bongo drums; painting a naked female toreador. In short, here is Feynman's life in all its eccentric—a combustible mixture of high intelligence, unlimited curiosity, and raging chutzpah.",
        "image": "http://books.google.com/books/content?id=7papZR4oVssC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=c92b3aa24e66c154fa8c99879c005e80",
        "epub": "http://gen.lib.rus.ec/get.php?md5=bd6202162337eb9f26930a955967d83f",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=3e123f74a524f71a99351cfe20124a65"
    },
    "_CWlKRYLbIwC": {
        "title": "A Short History of Nearly Everything",
        "author": [
            "Bill Bryson"
        ],
        "publisher": "Anchor Canada",
        "publishedDate": "2012-05-15",
        "pages": 560,
        "rating": 4,
        "description": "One of the world’s most beloved and bestselling writers takes his ultimate journey -- into the most intriguing and intractable questions that science seeks to answer. In A Walk in the Woods, Bill Bryson trekked the Appalachian Trail -- well, most of it. In In A Sunburned Country, he confronted some of the most lethal wildlife Australia has to offer. Now, in his biggest book, he confronts his greatest challenge: to understand -- and, if possible, answer -- the oldest, biggest questions we have posed about the universe and ourselves. Taking as territory everything from the Big Bang to the rise of civilization, Bryson seeks to understand how we got from there being nothing at all to there being us. To that end, he has attached himself to a host of the world’s most advanced (and often obsessed) archaeologists, anthropologists, and mathematicians, travelling to their offices, laboratories, and field camps. He has read (or tried to read) their books, pestered them with questions, apprenticed himself to their powerful minds. A Short History of Nearly Everything is the record of this quest, and it is a sometimes profound, sometimes funny, and always supremely clear and entertaining adventure in the realms of human knowledge, as only Bill Bryson can render it. Science has never been more involving or entertaining. From the Hardcover edition.",
        "image": "http://books.google.com/books/content?id=_CWlKRYLbIwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=9fff3cd143688bb899c4e3c3506c3bd5",
        "epub": "http://gen.lib.rus.ec/get.php?md5=adc4514330236b862772900cc1a0d6ab",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=52fec8e9776901cabec19b66cfb540fe"
    },
    "yBYmAAAAMAAJ": {
        "title": "The Adventures of Tom Sawyer",
        "author": [
            "Mark Twain"
        ],
        "publishedDate": "1881",
        "pages": 274,
        "rating": 4,
        "image": "http://books.google.com/books/content?id=yBYmAAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=cf8edfb26fde6292eb7f783e508d06dd"
    },
    "ilRoAwAAQBAJ": {
        "title": "Frankenstein",
        "author": [
            "Mary Shelley"
        ],
        "publisher": "BookRix",
        "publishedDate": "2017-05-22",
        "pages": 301,
        "rating": 4,
        "description": "Frankenstein is a novel written by British author Mary Shelley about eccentric scientist Victor Frankenstein, who creates a grotesque creature in an unorthodox scientific experiment. Frankenstein is infused with some elements of the Gothic novel and the Romantic movement and is also considered to be one of the earliest examples of science fiction. Brian Aldiss has argued that it should be considered the first true science fiction story, because unlike in previous stories with fantastical elements resembling those of later science fiction, the central character \"makes a deliberate decision\" and \"turns to modern experiments in the laboratory\" to achieve fantastic results. It has had a considerable influence across literature and popular culture and spawned a complete genre of horror stories, films, and plays. Since publication of the novel, the name \"Frankenstein\" is often used to refer to the monster itself. This usage is sometimes considered erroneous, but usage commentators regard the monster sense of \"Frankenstein\" as well-established and an acceptable usage. In the novel, the monster is identified via words such as \"creature\", \"monster\", \"fiend\", \"wretch\", \"vile insect\", \"daemon\", \"being\", and \"it\". Speaking to Victor Frankenstein, the monster refers to himself as \"the Adam of your labors\", and elsewhere as someone who \"would have\" been \"your Adam\", but is instead \"your fallen angel.\"",
        "image": "http://books.google.com/books/content?id=ilRoAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=bfc01601daec13753f0b479c01169d37"
    },
    "x7vaDgAAQBAJ": {
        "title": "Einstein",
        "author": [
            "Walter Isaacson"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2008-05-13",
        "pages": 704,
        "rating": 4,
        "description": "A narrative portrait based on the complete body of Einstein's papers offers insight into his contributions to science, in an account that describes the influence of his discoveries on his personal views about morality, politics, and tolerance.",
        "image": "http://books.google.com/books/content?id=x7vaDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=0bcedfa53edc357d0c757b64e533909a",
        "epub": "http://gen.lib.rus.ec/get.php?md5=5fdeaba0c1d3dd537a1990f21f0f26a6",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=4deaba9a040d85db421107b3c887ca5f"
    },
    "qEoOl9bcV_cC": {
        "title": "Jane Eyre",
        "author": [
            "Charlotte Brontë"
        ],
        "publishedDate": "1890",
        "rating": 4,
        "image": "http://books.google.com/books/content?id=JuA0AAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=ce8b6db8a92de853fcacd452e835d62f",
        "_locals": {}
    },
    "JuA0AAAAMAAJ": {
        "title": "Jane Eyre",
        "author": [
            "Charlotte Brontë"
        ],
        "publishedDate": "1890",
        "rating": 4,
        "image": "http://books.google.com/books/content?id=JuA0AAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=ce8b6db8a92de853fcacd452e835d62f",
        "_locals": {}
    },
    "E7mEnx3zE4AC": {
        "title": "A Brief History of Time",
        "author": [
            "Stephen W. Hawking"
        ],
        "publisher": "Random House of Canada",
        "publishedDate": "1998",
        "pages": 212,
        "rating": 4,
        "description": "An anniversary edition of a now-classic survey of the origin and nature of the universe features a new introduction by the author and a new chapter on the possibility of time travel and \"wormholes\" in space",
        "image": "http://books.google.com/books/content?id=E7mEnx3zE4AC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=e36f033611cb270650e06437b4994902",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=44f20116d682817619c770fcdbf66123"
    },
    "YuLuAn3itnAC": {
        "title": "The Sirens of Titan",
        "author": [
            "Kurt Vonnegut"
        ],
        "publisher": "Dial Press",
        "publishedDate": "2007-12-18",
        "pages": 336,
        "rating": 4,
        "description": "The Sirens of Titan is an outrageous romp through space, time, and morality. The richest, most depraved man on Earth, Malachi Constant, is offered a chance to take a space journey to distant worlds with a beautiful woman at his side. Of course there’s a catch to the invitation–and a prophetic vision about the purpose of human life that only Vonnegut has the courage to tell. From the Trade Paperback edition.",
        "image": "http://books.google.com/books/content?id=YuLuAn3itnAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=74642a67f322d22a3697c24b0e790a4a",
        "epub": "http://gen.lib.rus.ec/get.php?md5=3834cc0b0ccda43fa5286363691dbc4f",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=b3283218d9f42ec13374dbede608876d"
    },
    "8iwrxNgYaDsC": {
        "title": "Anathem",
        "author": [
            "Neal Stephenson"
        ],
        "publisher": "Harper Collins",
        "publishedDate": "2009-10-06",
        "pages": 1008,
        "rating": 4,
        "description": "A #1 New York Times Bestseller, Anathem is perhaps the most brilliant literary invention to date from the incomparable Neal Stephenson, who rocked the world with Snow Crash, Cryptonomicon, and The Baroque Cycle. Now he imagines an alternate universe where scientists, philosophers, and mathematicians live in seclusion behind ancient monastery walls until they are called back into the world to deal with a crisis of astronomical proportions. Anathem won the Locus Award for Best Science Fiction Novel and the reviews for have been dazzling: “Brilliant” (South Florida Sun-Sentinel), “Daring” (Boston Globe), “Immensely entertaining” (New York Times Book Review), “A tour de force” (St. Louis Post-Dispatch), while Time magazine proclaims, “The great novel of ideas…has morphed into science fiction, and Neal Stephenson is its foremost practitioner.”",
        "image": "http://books.google.com/books/content?id=8iwrxNgYaDsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=c2ab0a2c084b4c17bccb100b21041a3a",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=9bea35dead19a161ef426b5a5b3bd3d2"
    },
    "z9Q99X-OOtAC": {
        "title": "The Secret",
        "author": [
            "Rhonda Byrne"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2011-07-07",
        "pages": 216,
        "rating": 3,
        "description": "The tenth-anniversary edition of the book that changed lives in profound ways, now with a new foreword and afterword. In 2006, a groundbreaking feature-length film revealed the great mystery of the universe—The Secret—and, later that year, Rhonda Byrne followed with a book that became a worldwide bestseller. Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you’ll learn how to use The Secret in every aspect of your life—money, health, relationships, happiness, and in every interaction you have in the world. You’ll begin to understand the hidden, untapped power that’s within you, and this revelation can bring joy to every aspect of your life. The Secret contains wisdom from modern-day teachers—men and women who have used it to achieve health, wealth, and happiness. By applying the knowledge of The Secret, they bring to light compelling stories of eradicating disease, acquiring massive wealth, overcoming obstacles, and achieving what many would regard as impossible.",
        "image": "http://books.google.com/books/content?id=z9Q99X-OOtAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=b11b7dd1c96f2ff67a6504e48d2eda17"
    },
    "fH_ptQ6LoQEC": {
        "title": "Cloud Atlas",
        "author": [
            "David Mitchell"
        ],
        "publisher": "Vintage Canada",
        "publishedDate": "2010-07-16",
        "pages": 528,
        "rating": 4,
        "description": "By the New York Times bestselling author of The Bone Clocks | Shortlisted for the Man Booker Prize A postmodern visionary and one of the leading voices in twenty-first-century fiction, David Mitchell combines flat-out adventure, a Nabokovian love of puzzles, a keen eye for character, and a taste for mind-bending, philosophical and scientific speculation in the tradition of Umberto Eco, Haruki Murakami, and Philip K. Dick. The result is brilliantly original fiction as profound as it is playful. In this groundbreaking novel, an influential favorite among a new generation of writers, Mitchell explores with daring artistry fundamental questions of reality and identity. Cloud Atlas begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . . Abruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history. But the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky. As wild as a videogame, as mysterious as a Zen koan, Cloud Atlas is an unforgettable tour de force that, like its incomparable author, has transcended its cult classic status to become a worldwide phenomenon. Praise for Cloud Atlas “[David] Mitchell is, clearly, a genius. He writes as though at the helm of some perpetual dream machine, can evidently do anything, and his ambition is written in magma across this novel’s every page.”—The New York Times Book Review “One of those how-the-holy-hell-did-he-do-it? modern classics that no doubt is—and should be—read by any student of contemporary literature.”—Dave Eggers “Wildly entertaining . . . a head rush, both action-packed and chillingly ruminative.”—People “The novel as series of nested dolls or Chinese boxes, a puzzle-book, and yet—not just dazzling, amusing, or clever but heartbreaking and passionate, too. I’ve never read anything quite like it, and I’m grateful to have lived, for a while, in all its many worlds.”—Michael Chabon “Cloud Atlas ought to make [Mitchell] famous on both sides of the Atlantic as a writer whose fearlessness is matched by his talent.”—The Washington Post Book World “Thrilling . . . One of the biggest joys in Cloud Atlas is watching Mitchell sashay from genre to genre without a hitch in his dance step.”—Boston Sunday Globe “Grand and elaborate . . . [Mitchell] creates a world and language at once foreign and strange, yet strikingly familiar and intimate.”—Los Angeles Times From the Hardcover edition.",
        "image": "http://books.google.com/books/content?id=EoxXLiC0uAIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=bb0565c8903dc6190a8f5542dd8861d4",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=1921db45ae015fadb6c88c05c5a1c760",
        "_locals": {}
    },
    "EoxXLiC0uAIC": {
        "title": "Cloud Atlas",
        "author": [
            "David Mitchell"
        ],
        "publisher": "Vintage Canada",
        "publishedDate": "2010-07-16",
        "pages": 528,
        "rating": 4,
        "description": "By the New York Times bestselling author of The Bone Clocks | Shortlisted for the Man Booker Prize A postmodern visionary and one of the leading voices in twenty-first-century fiction, David Mitchell combines flat-out adventure, a Nabokovian love of puzzles, a keen eye for character, and a taste for mind-bending, philosophical and scientific speculation in the tradition of Umberto Eco, Haruki Murakami, and Philip K. Dick. The result is brilliantly original fiction as profound as it is playful. In this groundbreaking novel, an influential favorite among a new generation of writers, Mitchell explores with daring artistry fundamental questions of reality and identity. Cloud Atlas begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . . Abruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history. But the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky. As wild as a videogame, as mysterious as a Zen koan, Cloud Atlas is an unforgettable tour de force that, like its incomparable author, has transcended its cult classic status to become a worldwide phenomenon. Praise for Cloud Atlas “[David] Mitchell is, clearly, a genius. He writes as though at the helm of some perpetual dream machine, can evidently do anything, and his ambition is written in magma across this novel’s every page.”—The New York Times Book Review “One of those how-the-holy-hell-did-he-do-it? modern classics that no doubt is—and should be—read by any student of contemporary literature.”—Dave Eggers “Wildly entertaining . . . a head rush, both action-packed and chillingly ruminative.”—People “The novel as series of nested dolls or Chinese boxes, a puzzle-book, and yet—not just dazzling, amusing, or clever but heartbreaking and passionate, too. I’ve never read anything quite like it, and I’m grateful to have lived, for a while, in all its many worlds.”—Michael Chabon “Cloud Atlas ought to make [Mitchell] famous on both sides of the Atlantic as a writer whose fearlessness is matched by his talent.”—The Washington Post Book World “Thrilling . . . One of the biggest joys in Cloud Atlas is watching Mitchell sashay from genre to genre without a hitch in his dance step.”—Boston Sunday Globe “Grand and elaborate . . . [Mitchell] creates a world and language at once foreign and strange, yet strikingly familiar and intimate.”—Los Angeles Times From the Hardcover edition.",
        "image": "http://books.google.com/books/content?id=EoxXLiC0uAIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=bb0565c8903dc6190a8f5542dd8861d4",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=1921db45ae015fadb6c88c05c5a1c760",
        "_locals": {}
    },
    "l9b7oQEACAAJ": {
        "title": "Half Girlfriend",
        "author": [
            "Chetan Bhagat"
        ],
        "publishedDate": "2014-10-01",
        "pages": 280,
        "rating": 4.5,
        "image": "http://books.google.com/books/content?id=l9b7oQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=affc310fac39fb54766a61ccd0604169"
    },
    "4FmpBAAAQBAJ": {
        "title": "Dirk Gently's Holistic Detective Agency",
        "author": [
            "Douglas Adams"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2014-10-07",
        "pages": 260,
        "rating": 3.5,
        "description": "From Douglas Adams, the legendary author of one of the most beloved science fiction novels of all time, The Hitchhiker’s Guide to the Galaxy, comes a wildly inventive novel—in trade paperback for the first time—of ghosts, time travel, and one detective’s mission to save humanity from extinction. DIRK GENTLY’S HOLISTIC DETECTIVE AGENCY We solve the whole crime We find the whole person Phone today for the whole solution to your problem (Missing cats and messy divorces a specialty) Douglas Adams, the “master of wacky words and even wackier tales” (Entertainment Weekly) once again boggles the mind with a completely unbelievable story of ghosts, time travel, eccentric computer geniuses, Samuel Taylor Coleridge, the end of the world, and—of course—missing cats.",
        "image": "http://books.google.com/books/content?id=4FmpBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://libgen.io/get.php?md5=b98a1ef41f49bb196bb798b5a3e88b37",
        "pdf": "http://libgen.io/get.php?md5=0a98c217e4ab8822c57e7d25d21f5a89"
    },
    "S7uDAQAACAAJ": {
        "id": "1lK3xA72adAC",
        "title": "Starship Troopers",
        "author": [
            "Robert A. Heinlein"
        ],
        "publisher": "Penguin",
        "publishedDate": "1987-05-15",
        "pages": 352,
        "rating": 4,
        "description": "In Robert A. Heinlein’s controversial bestseller, a recruit of the future goes through the toughest boot camp in the Universe—and into battle against mankind’s most alarming enemy. JOIN THE ARMY AND SEE THE UNIVERSE The historians can’t seem to settle whether to call this one “The Third Space War” (or the fourth), or whether “The First Interstellar War” fits it better. The soldiers just call it “The Bug War.” Everything up to then and still later were “incidents,” “patrols,” or “police actions.” In the Mobile Infantry, everybody fights. But you're just as dead if you buy the farm in an “incident” as you are if you buy it in a declared war... “A classic…If you want a great military adventure, this one is for you.”—All SciFi",
        "image": "http://books.google.com/books/content?id=1lK3xA72adAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=fc3c0fee94abc04be6815f232e767f15",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=2c5173c61ac0dc2daafc3f22c756bb9c",
        "_locals": {}
    },
    "1lK3xA72adAC": {
        "id": "1lK3xA72adAC",
        "title": "Starship Troopers",
        "author": [
            "Robert A. Heinlein"
        ],
        "publisher": "Penguin",
        "publishedDate": "1987-05-15",
        "pages": 352,
        "rating": 4,
        "description": "In Robert A. Heinlein’s controversial bestseller, a recruit of the future goes through the toughest boot camp in the Universe—and into battle against mankind’s most alarming enemy. JOIN THE ARMY AND SEE THE UNIVERSE The historians can’t seem to settle whether to call this one “The Third Space War” (or the fourth), or whether “The First Interstellar War” fits it better. The soldiers just call it “The Bug War.” Everything up to then and still later were “incidents,” “patrols,” or “police actions.” In the Mobile Infantry, everybody fights. But you're just as dead if you buy the farm in an “incident” as you are if you buy it in a declared war... “A classic…If you want a great military adventure, this one is for you.”—All SciFi",
        "image": "http://books.google.com/books/content?id=1lK3xA72adAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=fc3c0fee94abc04be6815f232e767f15",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=2c5173c61ac0dc2daafc3f22c756bb9c",
        "_locals": {}
    },
    "nVQPAAAAQBAJ": {
        "id": "nVQPAAAAQBAJ",
        "title": "The Design of Everyday Things",
        "author": [
            "Don Norman"
        ],
        "publisher": "Basic Books",
        "publishedDate": "2013-11-05",
        "pages": 384,
        "rating": 3,
        "description": "In this entertaining and insightful analysis, cognitive scientist Don Norman hails excellence of design as the most important key to regaining the competitive edge in influencing consumer behavior. Even the smartest among us can feel inept as we fail to figure out which light switch or oven burner to turn on, or whether to push, pull, or slide a door. The fault, argues this ingenious-even liberating-book, lies not in ourselves, but in product design that ignores the needs of users and the principles of cognitive psychology. The problems range from ambiguous and hidden controls to arbitrary relationships between controls and functions, coupled with a lack of feedback or other assistance and unreasonable demands on memorization. The Design of Everyday Things shows that good, usable design is possible. The rules are simple: make things visible, exploit natural relationships that couple function and control, and make intelligent use of constraints. The goal: guide the user effortlessly to the right action on the right control at the right time. The Design of Everyday Things is a powerful primer on how-and why-some products satisfy customers while others only frustrate them.",
        "image": "http://books.google.com/books/content?id=nVQPAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=69c5de1732e0eed283313809abc02c90",
        "epub": "http://gen.lib.rus.ec/get.php?md5=f4e019eb23bb13b8cd3bf28f16182706",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=4bb8d08a9b309df7d86e62ec4056ceef"
    },
    "qq2ZDAAAQBAJ": {
        "id": "qq2ZDAAAQBAJ",
        "title": "Frankenstein",
        "author": [
            "Mary Shelley"
        ],
        "publisher": "The Artisan Shoppe",
        "publishedDate": "2016-07-01",
        "rating": 3.5,
        "image": "http://books.google.com/books/content?id=qq2ZDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=bfc01601daec13753f0b479c01169d37"
    },
    "nv9lZM_0RI4C": {
        "id": "gx2ev_vwGKAC",
        "title": "Zen and the Art of Motorcycle Maintenance",
        "author": [
            "Robert M. Pirsig"
        ],
        "publisher": "Harper Collins",
        "publishedDate": "2009-04-21",
        "pages": 560,
        "rating": 3.5,
        "description": "Acclaimed as one of the most exciting books in the history of American letters, this modern epic became an instant bestseller upon publication in 1974, transforming a generation and continuing to inspire millions. This 25th Anniversary Quill Edition features a new introduction by the author; important typographical changes; and a Reader's Guide that includes discussion topics, an interview with the author, and letters and documents detailing how this extraordinary book came to be. A narration of a summer motorcycle trip undertaken by a father and his son, the book becomes a personal and philosophical odyssey into fundamental questions of how to live. The narrator's relationship with his son leads to a powerful self-reckoning; the craft of motorcycle maintenance leads to an austerely beautiful process for reconciling science, religion, and humanism. Resonant with the confusions of existence, Zen and the Art of Motorcycle Maintenance is a touching and transcendent book of life.",
        "image": "http://books.google.com/books/content?id=gx2ev_vwGKAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=a377176497593b13a0cd78db95c95f6f",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=3f0b4c2b0e17460d10638dd8646b38c8",
        "_locals": {}
    },
    "qcDM4-3R168C": {
        "id": "gx2ev_vwGKAC",
        "title": "Zen and the Art of Motorcycle Maintenance",
        "author": [
            "Robert M. Pirsig"
        ],
        "publisher": "Harper Collins",
        "publishedDate": "2009-04-21",
        "pages": 560,
        "rating": 3.5,
        "description": "Acclaimed as one of the most exciting books in the history of American letters, this modern epic became an instant bestseller upon publication in 1974, transforming a generation and continuing to inspire millions. This 25th Anniversary Quill Edition features a new introduction by the author; important typographical changes; and a Reader's Guide that includes discussion topics, an interview with the author, and letters and documents detailing how this extraordinary book came to be. A narration of a summer motorcycle trip undertaken by a father and his son, the book becomes a personal and philosophical odyssey into fundamental questions of how to live. The narrator's relationship with his son leads to a powerful self-reckoning; the craft of motorcycle maintenance leads to an austerely beautiful process for reconciling science, religion, and humanism. Resonant with the confusions of existence, Zen and the Art of Motorcycle Maintenance is a touching and transcendent book of life.",
        "image": "http://books.google.com/books/content?id=gx2ev_vwGKAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=a377176497593b13a0cd78db95c95f6f",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=3f0b4c2b0e17460d10638dd8646b38c8",
        "_locals": {}
    },
    "gx2ev_vwGKAC": {
        "id": "gx2ev_vwGKAC",
        "title": "Zen and the Art of Motorcycle Maintenance",
        "author": [
            "Robert M. Pirsig"
        ],
        "publisher": "Harper Collins",
        "publishedDate": "2009-04-21",
        "pages": 560,
        "rating": 3.5,
        "description": "Acclaimed as one of the most exciting books in the history of American letters, this modern epic became an instant bestseller upon publication in 1974, transforming a generation and continuing to inspire millions. This 25th Anniversary Quill Edition features a new introduction by the author; important typographical changes; and a Reader's Guide that includes discussion topics, an interview with the author, and letters and documents detailing how this extraordinary book came to be. A narration of a summer motorcycle trip undertaken by a father and his son, the book becomes a personal and philosophical odyssey into fundamental questions of how to live. The narrator's relationship with his son leads to a powerful self-reckoning; the craft of motorcycle maintenance leads to an austerely beautiful process for reconciling science, religion, and humanism. Resonant with the confusions of existence, Zen and the Art of Motorcycle Maintenance is a touching and transcendent book of life.",
        "image": "http://books.google.com/books/content?id=gx2ev_vwGKAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=a377176497593b13a0cd78db95c95f6f",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=3f0b4c2b0e17460d10638dd8646b38c8",
        "_locals": {}
    },
    "RxAJAAAAIAAJ": {
        "id": "iO5pApw2JycC",
        "title": "The Ivory Tower and Harry Potter",
        "author": [
            "Lana A. Whited"
        ],
        "publisher": "University of Missouri Press",
        "publishedDate": "2004",
        "pages": 418,
        "rating": 4.5,
        "description": "Now available in paper, The Ivory Tower and Harry Potter is the first book-length analysis of J. K. Rowling's work from a broad range of perspectives within literature, folklore, psychology, sociology, and popular culture. A significant portion of the book explores the Harry Potter series' literary ancestors, including magic and fantasy works by Ursula K. LeGuin, Monica Furlong, Jill Murphy, and others, as well as previous works about the British boarding school experience. Other chapters explore the moral and ethical dimensions of Harry's world, including objections to the series raised within some religious circles. In her new epilogue, Lana A. Whited brings this volume up to date by covering Rowling's latest book, Harry Potter and the Order of the Phoenix.",
        "image": "http://books.google.com/books/content?id=iO5pApw2JycC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=393015b78fe39710570c7fb73cce1502",
        "_locals": {}
    },
    "iO5pApw2JycC": {
        "id": "iO5pApw2JycC",
        "title": "The Ivory Tower and Harry Potter",
        "author": [
            "Lana A. Whited"
        ],
        "publisher": "University of Missouri Press",
        "publishedDate": "2004",
        "pages": 418,
        "rating": 4.5,
        "description": "Now available in paper, The Ivory Tower and Harry Potter is the first book-length analysis of J. K. Rowling's work from a broad range of perspectives within literature, folklore, psychology, sociology, and popular culture. A significant portion of the book explores the Harry Potter series' literary ancestors, including magic and fantasy works by Ursula K. LeGuin, Monica Furlong, Jill Murphy, and others, as well as previous works about the British boarding school experience. Other chapters explore the moral and ethical dimensions of Harry's world, including objections to the series raised within some religious circles. In her new epilogue, Lana A. Whited brings this volume up to date by covering Rowling's latest book, Harry Potter and the Order of the Phoenix.",
        "image": "http://books.google.com/books/content?id=iO5pApw2JycC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=393015b78fe39710570c7fb73cce1502",
        "_locals": {}
    },
    "BG3P0sFxnT4C": {
        "id": "BG3P0sFxnT4C",
        "title": "Insurgent",
        "author": [
            "Veronica Roth"
        ],
        "publisher": "Harper Collins",
        "publishedDate": "2012-05-01",
        "pages": 592,
        "rating": 4,
        "description": "Now includes an excerpt from the upcoming Four: A Divergent Collection. One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love. Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so. New York Times bestselling author Veronica Roth's much-anticipated second book of the dystopian Divergent series is another intoxicating thrill ride of a story, rich with hallmark twists, heartbreaks, romance, and powerful insights about human nature.",
        "image": "http://books.google.com/books/content?id=BG3P0sFxnT4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=ab84162ed75ee1c144b950569890b6b6",
        "pdf": false
    },
    "LwvsDAAAQBAJ": {
        "id": "LwvsDAAAQBAJ",
        "title": "American Kingpin",
        "author": [
            "Nick Bilton"
        ],
        "publisher": "Penguin",
        "publishedDate": "2017-05-02",
        "pages": 304,
        "description": "NEW YORK TIMES BESTSELLER. The unbelievable true story of the man who built a billion-dollar online drug empire from his bedroom—and almost got away with it In 2011, a twenty-six-year-old libertarian programmer named Ross Ulbricht launched the ultimate free market: the Silk Road, a clandestine Web site hosted on the Dark Web where anyone could trade anything—drugs, hacking software, forged passports, counterfeit cash, poisons—free of the government’s watchful eye. It wasn’t long before the media got wind of the new Web site where anyone—not just teenagers and weed dealers but terrorists and black hat hackers—could buy and sell contraband detection-free. Spurred by a public outcry, the federal government launched an epic two-year manhunt for the site’s elusive proprietor, with no leads, no witnesses, and no clear jurisdiction. All the investigators knew was that whoever was running the site called himself the Dread Pirate Roberts. The Silk Road quickly ballooned into $1.2 billion enterprise, and Ross embraced his new role as kingpin. He enlisted a loyal crew of allies in high and low places, all as addicted to the danger and thrill of running an illegal marketplace as their customers were to the heroin they sold. Through his network he got wind of the target on his back and took drastic steps to protect himself—including ordering a hit on a former employee. As Ross made plans to disappear forever, the Feds raced against the clock to catch a man they weren’t sure even existed, searching for a needle in the haystack of the global Internet. Drawing on exclusive access to key players and two billion digital words and images Ross left behind, Vanity Fair correspondent and New York Times bestselling author Nick Bilton offers a tale filled with twists and turns, lucky breaks and unbelievable close calls. It’s a story of the boy next door’s ambition gone criminal, spurred on by the clash between the new world of libertarian-leaning, anonymous, decentralized Web advocates and the old world of government control, order, and the rule of law. Filled with unforgettable characters and capped by an astonishing climax, American Kingpin might be dismissed as too outrageous for fiction. But it’s all too real.",
        "image": "http://books.google.com/books/content?id=LwvsDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=9c65be6eac7480bc7d9ce9771af79461",
        "pdf": false
    },
    "AlknCgAAQBAJ": {
        "id": "AlknCgAAQBAJ",
        "title": "Beginning Node.js",
        "author": [
            "Basarat Syed"
        ],
        "publisher": "Apress",
        "publishedDate": "2014-12-02",
        "pages": 308,
        "description": "Beginning Node.js is your step-by-step guide to learning all the aspects of creating maintainable Node.js applications. You will see how Node.js is focused on creating high-performing, highly-scalable websites, and how easy it is to get started. Many front-end devs regularly work with HTML, CSS, PHP, even WordPress, but haven't yet got started with Node.js. This book explains everything for you from a beginner level, enabling you to start using Node.js in your projects right away. Using this book you will learn important Node.js concepts for server-side programming. You will begin with an easy-to-follow pure JavaScript primer, which you can skip if you're confident of your JS skills. You'll then delve into Node.js concepts such as streams and events, and the technology involved in building full-stack Node.js applications. You'll also learn how to test your Node.js code, and deploy your Node.js applications on the internet. Node.js is a great and simple platform to work with. It is lightweight, easy to deploy and manage. You will see how using Node.js can be a fun and rewarding experience - start today with Beginning Node.js.",
        "image": "http://books.google.com/books/content?id=AlknCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=45c18e5abb6e798403b3f6bb999ca7a2",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=d6417284b2aaa02300217bcc561cf0cb"
    },
    "JcE_A1lo7dkC": {
        "id": "JcE_A1lo7dkC",
        "title": "True North",
        "author": [
            "Bill George"
        ],
        "publisher": "John Wiley & Sons",
        "publishedDate": "2010-06-10",
        "pages": 288,
        "rating": 4,
        "description": "True North shows how anyone who follows their internal compass can become an authentic leader. This leadership tour de force is based on research and first-person interviews with 125 of today’s top leaders—with some surprising results. In this important book, acclaimed former Medtronic CEO Bill George and coauthor Peter Sims share the wisdom of these outstanding leaders and describe how you can develop as an authentic leader. True North presents a concrete and comprehensive program for leadership success and shows how to create your own Personal Leadership Development Plan centered on five key areas: Knowing your authentic self Defining your values and leadership principles Understanding your motivations Building your support team Staying grounded by integrating all aspects of your life True North offers an opportunity for anyone to transform their leadership path and become the authentic leader they were born to be. Personal, original, and illuminating stories from Warren Bennis, Sir Adrian Cadbury, George Shultz (former U.S. secretary of state), Charles Schwab, John Whitehead (Cochairman, Goldman Sachs), Anne Mulcahy (CEO, Xerox), Howard Schultz (CEO, Starbucks), Dan Vasella (CEO, Novartis), John Brennan (Chairman, Vanguard), Carol Tome (CFO, Home Depot), Donna Dubinsky (CEO/cofounder, Palm), Alan Horn (President, Warner Brothers), Ann Moore (CEO, Time, Inc.) and many others illustrate the transitions that shape the type of leaders who will thrive in the 21st century. Bill George (Cambridge, MA) has spent over 30 years in executive leadership positions at Litton, Honeywell, and Medtronic. As CEO of Medtronic, he built the company into the world’s leading medical technology company as its market capitalization increased from $1.1 billion to $60 billion. Since 2004, he has been a professor at the Harvard Business School. His 2004 book Authentic Leadership (0-7879-7528-1) was a BusinessWeek bestseller. Peter Sims (San Francisco, CA) established “Leadership Perspectives,” a course on leadership development at the Stanford Graduate School of Business and cofounded the London office of Summit Partners, a leading investment firm. Their Web site is www.truenorthleaders.com.",
        "image": "http://books.google.com/books/content?id=JcE_A1lo7dkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=f300d984f2c7da916ab381ca64d3062a"
    },
    "Pi4pV0aha3gC": {
        "id": "Pi4pV0aha3gC",
        "title": "The First 20 Hours",
        "author": [
            "Josh Kaufman"
        ],
        "publisher": "Penguin",
        "publishedDate": "2013-06-13",
        "pages": 288,
        "rating": 2,
        "description": "Forget the 10,000 hour rule— what if it’s possible to learn the basics of any new skill in 20 hours or less? Take a moment to consider how many things you want to learn to do. What’s on your list? What’s holding you back from getting started? Are you worried about the time and effort it takes to acquire new skills—time you don’t have and effort you can’t spare? Research suggests it takes 10,000 hours to develop a new skill. In this nonstop world when will you ever find that much time and energy? To make matters worse, the early hours of prac­ticing something new are always the most frustrating. That’s why it’s difficult to learn how to speak a new language, play an instrument, hit a golf ball, or shoot great photos. It’s so much easier to watch TV or surf the web . . . In The First 20 Hours, Josh Kaufman offers a systematic approach to rapid skill acquisition— how to learn any new skill as quickly as possible. His method shows you how to deconstruct com­plex skills, maximize productive practice, and remove common learning barriers. By complet­ing just 20 hours of focused, deliberate practice you’ll go from knowing absolutely nothing to performing noticeably well. Kaufman personally field-tested the meth­ods in this book. You’ll have a front row seat as he develops a personal yoga practice, writes his own web-based computer programs, teaches himself to touch type on a nonstandard key­board, explores the oldest and most complex board game in history, picks up the ukulele, and learns how to windsurf. Here are a few of the sim­ple techniques he teaches: Define your target performance level: Fig­ure out what your desired level of skill looks like, what you’re trying to achieve, and what you’ll be able to do when you’re done. The more specific, the better. Deconstruct the skill: Most of the things we think of as skills are actually bundles of smaller subskills. If you break down the subcompo­nents, it’s easier to figure out which ones are most important and practice those first. Eliminate barriers to practice: Removing common distractions and unnecessary effort makes it much easier to sit down and focus on deliberate practice. Create fast feedback loops: Getting accu­rate, real-time information about how well you���re performing during practice makes it much easier to improve. Whether you want to paint a portrait, launch a start-up, fly an airplane, or juggle flaming chain­saws, The First 20 Hours will help you pick up the basics of any skill in record time . . . and have more fun along the way.",
        "image": "http://books.google.com/books/content?id=Pi4pV0aha3gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=8e2b666ad5e9585427b9857b72f835dc",
        "epub": "http://gen.lib.rus.ec/get.php?md5=3c7e25c1725740c517cc5cb4caa0d985",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=68998f1afa991f4ac4f86df2007788ad"
    },
    "OPGbBQAAQBAJ": {
        "id": "MpLXWHp-srIC",
        "title": "Fabricated",
        "author": [
            "Hod Lipson",
            "Melba Kurman"
        ],
        "publisher": "John Wiley & Sons",
        "publishedDate": "2013-01-22",
        "pages": 320,
        "rating": 5,
        "description": "Fabricated tells the story of 3D printers, humble manufacturing machines that are bursting out of the factory and into schools, kitchens, hospitals, even onto the fashion catwalk. Fabricated describes our emerging world of printable products, where people design and 3D print their own creations as easily as they edit an online document. A 3D printer transforms digital information into a physical object by carrying out instructions from an electronic design file, or 'blueprint.' Guided by a design file, a 3D printer lays down layer after layer of a raw material to 'print' out an object. That's not the whole story, however. The magic happens when you plug a 3D printer into today’s mind-boggling digital technologies. Add to that the Internet, tiny, low cost electronic circuitry, radical advances in materials science and biotech and voila! The result is an explosion of technological and social innovation. Fabricated takes the reader onto a rich and fulfilling journey that explores how 3D printing is poised to impact nearly every part of our lives. Aimed at people who enjoy books on business strategy, popular science and novel technology, Fabricated will provide readers with practical and imaginative insights to the question 'how will this technology change my life?' Based on hundreds of hours of research and dozens of interviews with experts from a broad range of industries, Fabricated offers readers an informative, engaging and fast-paced introduction to 3D printing now and in the future.",
        "image": "http://books.google.com/books/content?id=MpLXWHp-srIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=5295eab04d61fd161256b7bf9f1002ba",
        "epub": "http://gen.lib.rus.ec/get.php?md5=cdc553676bd58e71f2f5746770ed5cb7",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=1780670c2caa0a6eca762db0d5819f81",
        "_locals": {}
    },
    "MpLXWHp-srIC": {
        "id": "MpLXWHp-srIC",
        "title": "Fabricated",
        "author": [
            "Hod Lipson",
            "Melba Kurman"
        ],
        "publisher": "John Wiley & Sons",
        "publishedDate": "2013-01-22",
        "pages": 320,
        "rating": 5,
        "description": "Fabricated tells the story of 3D printers, humble manufacturing machines that are bursting out of the factory and into schools, kitchens, hospitals, even onto the fashion catwalk. Fabricated describes our emerging world of printable products, where people design and 3D print their own creations as easily as they edit an online document. A 3D printer transforms digital information into a physical object by carrying out instructions from an electronic design file, or 'blueprint.' Guided by a design file, a 3D printer lays down layer after layer of a raw material to 'print' out an object. That's not the whole story, however. The magic happens when you plug a 3D printer into today’s mind-boggling digital technologies. Add to that the Internet, tiny, low cost electronic circuitry, radical advances in materials science and biotech and voila! The result is an explosion of technological and social innovation. Fabricated takes the reader onto a rich and fulfilling journey that explores how 3D printing is poised to impact nearly every part of our lives. Aimed at people who enjoy books on business strategy, popular science and novel technology, Fabricated will provide readers with practical and imaginative insights to the question 'how will this technology change my life?' Based on hundreds of hours of research and dozens of interviews with experts from a broad range of industries, Fabricated offers readers an informative, engaging and fast-paced introduction to 3D printing now and in the future.",
        "image": "http://books.google.com/books/content?id=MpLXWHp-srIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=5295eab04d61fd161256b7bf9f1002ba",
        "epub": "http://gen.lib.rus.ec/get.php?md5=cdc553676bd58e71f2f5746770ed5cb7",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=1780670c2caa0a6eca762db0d5819f81",
        "_locals": {}
    },
    "Nhe2yvx6hP8C": {
        "id": "2vnbMzYXBQsC",
        "title": "I, Robot",
        "author": [
            "Isaac Asimov"
        ],
        "publisher": "Spectra",
        "publishedDate": "2004-06-01",
        "pages": 304,
        "rating": 4,
        "description": "The three laws of Robotics: 1) A robot may not injure a human being or, through inaction, allow a human being to come to harm 2) A robot must obey orders givein to it by human beings except where such orders would conflict with the First Law. 3) A robot must protect its own existence as long as such protection does not conflict with the First or Second Law. With these three, simple directives, Isaac Asimov changed our perception of robots forever when he formulated the laws governing their behavior. In I, Robot, Asimov chronicles the development of the robot through a series of interlinked stories: from its primitive origins in the present to its ultimate perfection in the not-so-distant future--a future in which humanity itself may be rendered obsolete. Here are stories of robots gone mad, of mind-read robots, and robots with a sense of humor. Of robot politicians, and robots who secretly run the world--all told with the dramatic blend of science fact and science fiction that has become Asmiov's trademark.",
        "image": "http://books.google.com/books/content?id=2vnbMzYXBQsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=fd8cfa92e246865c52fb7d6c365459dc",
        "_locals": {}
    },
    "2vnbMzYXBQsC": {
        "id": "2vnbMzYXBQsC",
        "title": "I, Robot",
        "author": [
            "Isaac Asimov"
        ],
        "publisher": "Spectra",
        "publishedDate": "2004-06-01",
        "pages": 304,
        "rating": 4,
        "description": "The three laws of Robotics: 1) A robot may not injure a human being or, through inaction, allow a human being to come to harm 2) A robot must obey orders givein to it by human beings except where such orders would conflict with the First Law. 3) A robot must protect its own existence as long as such protection does not conflict with the First or Second Law. With these three, simple directives, Isaac Asimov changed our perception of robots forever when he formulated the laws governing their behavior. In I, Robot, Asimov chronicles the development of the robot through a series of interlinked stories: from its primitive origins in the present to its ultimate perfection in the not-so-distant future--a future in which humanity itself may be rendered obsolete. Here are stories of robots gone mad, of mind-read robots, and robots with a sense of humor. Of robot politicians, and robots who secretly run the world--all told with the dramatic blend of science fact and science fiction that has become Asmiov's trademark.",
        "image": "http://books.google.com/books/content?id=2vnbMzYXBQsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=fd8cfa92e246865c52fb7d6c365459dc",
        "_locals": {}
    },
    "87totx4p3ZcC": {
        "id": "Ql6QgWf6i7cC",
        "title": "Thinking in Java",
        "author": [
            "Bruce Eckel"
        ],
        "publisher": "Prentice Hall Professional",
        "publishedDate": "2003",
        "pages": 1119,
        "rating": 4,
        "description": "An overview of the programming language's fundamentals covers syntax, initialization, implementation, classes, error handling, objects, applets, multiple threads, projects, and network programming.",
        "image": "http://books.google.com/books/content?id=Ql6QgWf6i7cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=560b66bb79e8563ff1c4ae8000b7c8bd",
        "_locals": {}
    },
    "Ql6QgWf6i7cC": {
        "id": "Ql6QgWf6i7cC",
        "title": "Thinking in Java",
        "author": [
            "Bruce Eckel"
        ],
        "publisher": "Prentice Hall Professional",
        "publishedDate": "2003",
        "pages": 1119,
        "rating": 4,
        "description": "An overview of the programming language's fundamentals covers syntax, initialization, implementation, classes, error handling, objects, applets, multiple threads, projects, and network programming.",
        "image": "http://books.google.com/books/content?id=Ql6QgWf6i7cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=560b66bb79e8563ff1c4ae8000b7c8bd",
        "_locals": {}
    },
    "OzSJgdwk5esC": {
        "id": "OzSJgdwk5esC",
        "title": "Einstein",
        "author": [
            "Walter Isaacson"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2008-09-04",
        "pages": 704,
        "rating": 4,
        "description": "Einstein is the great icon of our age: the kindly refugee from oppression whose wild halo of hair, twinkling eyes, engaging humanity and extraordinary brilliance made his face a symbol and his name a synonym for genius. He was a rebel and nonconformist from boyhood days. His character, creativity and imagination were related, and they drove both his life and his science. In this marvellously clear and accessible narrative, Walter Isaacson explains how his mind worked and the mysteries of the universe that he discovered. Einstein's success came from questioning conventional wisdom and marvelling at mysteries that struck others as mundane. This led him to embrace a worldview based on respect for free spirits and free individuals. All of which helped make Einstein into a rebel but with a reverence for the harmony of nature, one with just the right blend of imagination and wisdom to transform our understanding of the universe. This new biography, the first since all of Einstein's papers have become available, is the fullest picture yet of one of the key figures of the twentieth century.",
        "image": "http://books.google.com/books/content?id=OzSJgdwk5esC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=0bcedfa53edc357d0c757b64e533909a",
        "epub": "http://gen.lib.rus.ec/get.php?md5=5fdeaba0c1d3dd537a1990f21f0f26a6",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=4deaba9a040d85db421107b3c887ca5f"
    },
    "20ISsQCKKmQC": {
        "id": "20ISsQCKKmQC",
        "title": "Quantum Optics",
        "author": [
            "Marlan O. Scully",
            "M. Suhail Zubairy"
        ],
        "publisher": "Cambridge University Press",
        "publishedDate": "1997-09-04",
        "pages": 630,
        "rating": 5,
        "description": "An in-depth and wide-ranging introduction to the field of quantum optics.",
        "image": "http://books.google.com/books/content?id=20ISsQCKKmQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=57841bb58432547050246d30869bef33"
    },
    "Zf-XKdeLuJkC": {
        "id": "Zf-XKdeLuJkC",
        "title": "Jane Eyre",
        "author": [
            "Charlotte Brontë"
        ],
        "publishedDate": "1855",
        "pages": 467,
        "image": "http://books.google.com/books/content?id=Zf-XKdeLuJkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=ce8b6db8a92de853fcacd452e835d62f"
    },
    "-Ac81W-ZQDEC": {
        "id": "0QE3BAAAQBAJ",
        "title": "The Nightingale",
        "author": [
            "Kristin Hannah"
        ],
        "publisher": "St. Martin's Press",
        "publishedDate": "2015-02-03",
        "pages": 448,
        "rating": 4.5,
        "description": "A #1 New York Times bestseller, Wall Street Journal Best Book of the Year, and soon to be a major motion picture, this unforgettable novel of love and strength in the face of war has enthralled a generation. With courage, grace, and powerful insight, bestselling author Kristin Hannah captures the epic panorama of World War II and illuminates an intimate part of history seldom seen: the women's war. The Nightingale tells the stories of two sisters, separated by years and experience, by ideals, passion and circumstance, each embarking on her own dangerous path toward survival, love, and freedom in German-occupied, war-torn France—a heartbreakingly beautiful novel that celebrates the resilience of the human spirit and the durability of women. It is a novel for everyone, a novel for a lifetime. Goodreads Best Historical Novel of the Year • People's Choice Favorite Fiction Winner • #1 Indie Next Selection • A Buzzfeed and The Week Best Book of the Year Praise for The Nightingale: \"Haunting, action-packed, and compelling.\" —Christina Baker Kline, #1 New York Times bestselling author \"Absolutely riveting!...Read this book.\" —Dr. Miriam Klein Kassenoff, Director of the University of Miami Holocaust Teacher Institute \"Beautifully written and richly evocative.\" —Sara Gruen, #1 New York Times bestselling author “A hauntingly rich WWII novel about courage, brutality, love, survival—and the essence of what makes us human.” —Family Circle “A heart-pounding story.” —USA Today \"An enormous story. Richly satisfying. I loved it.\" —Anne Rice \"A respectful and absorbing page-turner.\" —Kirkus Reviews \"Tender, compelling...a satisfying slice of life in Nazi-occupied France.\" —Jewish Book Council “Expect to devour The Nightingale in as few sittings as possible; the high-stakes plot and lovable characters won’t allow any rest until all of their fates are known.” —Shelf Awareness \"I loved The Nightingale.\" —Lisa See, #1 New York Times bestselling author \"Powerful...an unforgettable portrait of love and war.\" —People",
        "image": "http://books.google.com/books/content?id=0QE3BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=50ee5a1e437f05bbe5b385e3e1ff372d",
        "epub": false,
        "pdf": false,
        "_locals": {}
    },
    "0QE3BAAAQBAJ": {
        "id": "0QE3BAAAQBAJ",
        "title": "The Nightingale",
        "author": [
            "Kristin Hannah"
        ],
        "publisher": "St. Martin's Press",
        "publishedDate": "2015-02-03",
        "pages": 448,
        "rating": 4.5,
        "description": "A #1 New York Times bestseller, Wall Street Journal Best Book of the Year, and soon to be a major motion picture, this unforgettable novel of love and strength in the face of war has enthralled a generation. With courage, grace, and powerful insight, bestselling author Kristin Hannah captures the epic panorama of World War II and illuminates an intimate part of history seldom seen: the women's war. The Nightingale tells the stories of two sisters, separated by years and experience, by ideals, passion and circumstance, each embarking on her own dangerous path toward survival, love, and freedom in German-occupied, war-torn France—a heartbreakingly beautiful novel that celebrates the resilience of the human spirit and the durability of women. It is a novel for everyone, a novel for a lifetime. Goodreads Best Historical Novel of the Year • People's Choice Favorite Fiction Winner • #1 Indie Next Selection • A Buzzfeed and The Week Best Book of the Year Praise for The Nightingale: \"Haunting, action-packed, and compelling.\" —Christina Baker Kline, #1 New York Times bestselling author \"Absolutely riveting!...Read this book.\" —Dr. Miriam Klein Kassenoff, Director of the University of Miami Holocaust Teacher Institute \"Beautifully written and richly evocative.\" —Sara Gruen, #1 New York Times bestselling author “A hauntingly rich WWII novel about courage, brutality, love, survival—and the essence of what makes us human.” —Family Circle “A heart-pounding story.” —USA Today \"An enormous story. Richly satisfying. I loved it.\" —Anne Rice \"A respectful and absorbing page-turner.\" —Kirkus Reviews \"Tender, compelling...a satisfying slice of life in Nazi-occupied France.\" —Jewish Book Council “Expect to devour The Nightingale in as few sittings as possible; the high-stakes plot and lovable characters won’t allow any rest until all of their fates are known.” —Shelf Awareness \"I loved The Nightingale.\" —Lisa See, #1 New York Times bestselling author \"Powerful...an unforgettable portrait of love and war.\" —People",
        "image": "http://books.google.com/books/content?id=0QE3BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=50ee5a1e437f05bbe5b385e3e1ff372d",
        "epub": false,
        "pdf": false,
        "_locals": {}
    },
    "I6iaDAAAQBAJ": {
        "id": "wgdl6kBbYJMC",
        "title": "The Fish That Ate the Whale",
        "author": [
            "Rich Cohen"
        ],
        "publisher": "Macmillan",
        "publishedDate": "2012-06-05",
        "pages": 270,
        "rating": 4.5,
        "description": "The author of Sweet and Low presents a historical profile of Samuel Zemurray that traces his rise from a penniless youth to one of the world's wealthiest and most powerful men, offering insight into his capitalist talents and the ways in which his life reflected the best and worst of American business dealings.",
        "image": "http://books.google.com/books/content?id=wgdl6kBbYJMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=7df164413f058f60195dde1edd17602e",
        "epub": false,
        "pdf": false,
        "_locals": {}
    },
    "wgdl6kBbYJMC": {
        "id": "wgdl6kBbYJMC",
        "title": "The Fish That Ate the Whale",
        "author": [
            "Rich Cohen"
        ],
        "publisher": "Macmillan",
        "publishedDate": "2012-06-05",
        "pages": 270,
        "rating": 4.5,
        "description": "The author of Sweet and Low presents a historical profile of Samuel Zemurray that traces his rise from a penniless youth to one of the world's wealthiest and most powerful men, offering insight into his capitalist talents and the ways in which his life reflected the best and worst of American business dealings.",
        "image": "http://books.google.com/books/content?id=wgdl6kBbYJMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=7df164413f058f60195dde1edd17602e",
        "epub": false,
        "pdf": false,
        "_locals": {}
    },
    "IsolywWKZGIC": {
        "id": "IsolywWKZGIC",
        "title": "Mind Reader",
        "author": [
            "Lior Suchard"
        ],
        "publisher": "Harper Collins",
        "publishedDate": "2012-07-10",
        "pages": 240,
        "rating": 5,
        "description": "Renowned mentalist Lior Suchard has mystified audiences all over the world with demonstrations of his phenomenal gifts of mind reading, thought influencing, and telekinesis. In Mind Reader, Suchard celebrates the extraordinary capacity of the mind and shares secrets from his own performances and life stories, as well as from psychological studies. His creativity-boosting techniques enable readers to embrace their inner mentalist—and harness untapped mental powers to create positive change in their day-to-day life. Filled with illusions, riddles, puzzles, and practical tips, Mind Reader will help you unlock the hidden powers of your own mind.",
        "image": "http://books.google.com/books/content?id=IsolywWKZGIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=89410c2d575257d7c453a5c4cb9839ad",
        "pdf": false
    },
    "SUCtOwns7TEC": {
        "id": "SUCtOwns7TEC",
        "title": "The Social Construction of Technological Systems",
        "author": [
            "Wiebe E. Bijker",
            "Thomas Parke Hughes",
            "Trevor J. Pinch"
        ],
        "publisher": "MIT Press",
        "publishedDate": "1987",
        "pages": 405,
        "rating": 4,
        "description": "The impact of technology on society is clear and unmistakable. The influence ofsociety on technology is more subtle. The 13 essays in this book draw on a wide array of casestudies from cooking stoves to missile systems, from 15thÂ­century Portugal to today's AI labs- to outline an original research program based on a synthesis of ideas from the social studies ofscience and the history of technology. Together they affirm the need for a study of technology thatgives equal weight to technical, social, economic, and political questions.",
        "image": "http://books.google.com/books/content?id=SUCtOwns7TEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=0a216d96c43aaf8623109ecad3f5cf63"
    },
    "161QAAAAMAAJ": {
        "id": "161QAAAAMAAJ",
        "title": "The C Programming Language",
        "author": [
            "Brian W. Kernighan",
            "Dennis M. Ritchie"
        ],
        "publisher": "Prentice Hall Software",
        "publishedDate": "1988",
        "pages": 272,
        "rating": 4.5,
        "description": "Introduces the features of the C programming language, discusses data types, variables, operators, control flow, functions, pointers, arrays, and structures, and looks at the UNIX system interface",
        "image": "http://books.google.com/books/content?id=161QAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=556e6bee561b776c95c6872c441baad1"
    },
    "D9itF0aQvcYC": {
        "id": "D9itF0aQvcYC",
        "title": "Resolving Conflicts at Work",
        "author": [
            "Kenneth Cloke",
            "Joan Goldsmith"
        ],
        "publisher": "John Wiley & Sons",
        "publishedDate": "2011-04-08",
        "pages": 400,
        "description": "The classic text on resolving workplace conflicts, fully revised and updated Resolving Conflicts at Work is a guide for preventing and resolving conflicts, miscommunications, and misunderstandings at work, including dozens of techniques for revealing how the inevitable disputes and divisions in the workplace are actually opportunities for greater creativity, productivity, enhanced morale, and personal growth. In the third edition of this text, all chapters are completely infused with additional content, updated examples, and new case studies. Like its predecessors, it identifies core strategies for preventing and resolving both intermittent and chronic conflicts in the workplace. In addition, the book Includes a new foreword by Warren Bennis, which represents his most recent thinking about judgment calls and candid communications in the workplace Presents new chapters on leadership and transformational conflict coaching, and organizational systems design This definitive and comprehensive work provides a handy guide for managers, employees, union representatives, human resource experts, and consultants seeking to maintain stable and productive workplaces.",
        "image": "http://books.google.com/books/content?id=D9itF0aQvcYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=52dd3918bd46204c70cf45d370ee0abc"
    },
    "qOs0AAAAMAAJ": {
        "id": "qOs0AAAAMAAJ",
        "title": "Jane Eyre",
        "author": [
            "Charlotte Brontë"
        ],
        "publishedDate": "1906",
        "pages": 486,
        "rating": 4,
        "image": "http://books.google.com/books/content?id=qOs0AAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=ce8b6db8a92de853fcacd452e835d62f"
    },
    "tvfyz-4JILwC": {
        "id": "tvfyz-4JILwC",
        "title": "The Lean Startup",
        "author": [
            "Eric Ries"
        ],
        "publisher": "Crown Business",
        "publishedDate": "2011-09-13",
        "pages": 336,
        "rating": 4,
        "description": "Most startups fail. But many of those failures are preventable. The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched. Eric Ries defines a startup as an organization dedicated to creating something new under conditions of extreme uncertainty. This is just as true for one person in a garage or a group of seasoned professionals in a Fortune 500 boardroom. What they have in common is a mission to penetrate that fog of uncertainty to discover a successful path to a sustainable business. The Lean Startup approach fosters companies that are both more capital efficient and that leverage human creativity more effectively. Inspired by lessons from lean manufacturing, it relies on “validated learning,” rapid scientific experimentation, as well as a number of counter-intuitive practices that shorten product development cycles, measure actual progress without resorting to vanity metrics, and learn what customers really want. It enables a company to shift directions with agility, altering plans inch by inch, minute by minute. Rather than wasting time creating elaborate business plans, The Lean Startup offers entrepreneurs - in companies of all sizes - a way to test their vision continuously, to adapt and adjust before it’s too late. Ries provides a scientific approach to creating and managing successful startups in a age when companies need to innovate more than ever.",
        "image": "http://books.google.com/books/content?id=tvfyz-4JILwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=d0664b06d5b5c1c4249358acc5449ae1",
        "epub": "http://gen.lib.rus.ec/get.php?md5=968db38bd13cd8e47aeb2db5e321c32d",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=92a019dca81f725b44dfea5063f7f326"
    },
    "qQDdCgAAQBAJ": {
        "id": "qQDdCgAAQBAJ",
        "title": "Narconomics",
        "author": [
            "Tom Wainwright"
        ],
        "publisher": "PublicAffairs",
        "publishedDate": "2016-02-23",
        "pages": 288,
        "rating": 4,
        "description": "What drug lords learned from big business How does a budding cartel boss succeed (and survive) in the $300 billion illegal drug business? By learning from the best, of course. From creating brand value to fine-tuning customer service, the folks running cartels have been attentive students of the strategy and tactics used by corporations such as Walmart, McDonald’s, and Coca-Cola. And what can government learn to combat this scourge? By analyzing the cartels as companies, law enforcers might better understand how they work—and stop throwing away $100 billion a year in a futile effort to win the “war” against this global, highly organized business. Your intrepid guide to the most exotic and brutal industry on earth is Tom Wainwright. Picking his way through Andean cocaine fields, Central American prisons, Colorado pot shops, and the online drug dens of the Dark Web, Wainwright provides a fresh, innovative look into the drug trade and its 250 million customers. The cast of characters includes “Bin Laden,” the Bolivian coca guide; “Old Lin,” the Salvadoran gang leader; “Starboy,” the millionaire New Zealand pill maker; and a cozy Mexican grandmother who cooks blueberry pancakes while plotting murder. Along with presidents, cops, and teenage hitmen, they explain such matters as the business purpose for head-to-toe tattoos, how gangs decide whether to compete or collude, and why cartels care a surprising amount about corporate social responsibility. More than just an investigation of how drug cartels do business, Narconomics is also a blueprint for how to defeat them.",
        "image": "http://books.google.com/books/content?id=qQDdCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=8e45ea2fffe12be8b4051ca39e45ef79",
        "pdf": false,
        "_locals": {}
    },
    "2KFcJln1ozIC": {
        "id": "2KFcJln1ozIC",
        "title": "How to Talk So Kids Will Listen & Listen So Kids Will Talk",
        "author": [
            "Adele Faber",
            "Elaine Mazlish"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2012-02-07",
        "pages": 345,
        "rating": 4,
        "description": "Details a program for improving communication between parents and children, providing sample dialogues and role-playing exercises.",
        "image": "http://books.google.com/books/content?id=2KFcJln1ozIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://gen.lib.rus.ec/get.php?md5=8a054d74811a4d7d6be4e762239f50a8",
        "pdf": "http://gen.lib.rus.ec/get.php?md5=acd1377ba64ac978c8057dbb455e5c7c"
    },
    "gurAnfB4nvUC": {
        "id": "y4nmOe0-WD0C",
        "title": "This Is a Book",
        "author": [
            "Demetri Martin"
        ],
        "publisher": "Grand Central Publishing",
        "publishedDate": "2011-04-25",
        "pages": 288,
        "rating": 3.5,
        "description": "From the renowned comedian, creator, star and executive producer/multiple title-holder of Comedy Central's Important Things with Demetri Martin comes a bold, original, and rectangular kind of humor book. Demetri's first literary foray features longer-form essays and conceptual pieces (such as Protagonists' Hospital, a melodrama about the clinic doctors who treat only the flesh wounds and minor head scratches of Hollywood action heroes), as well as his trademark charts, doodles, drawings, one-liners, and lists (i.e., the world views of optimists, pessimists and contortionists), Martin's material is varied, but his unique voice and brilliant mind will keep readers in stitches from beginning to end.",
        "image": "http://books.google.com/books/content?id=y4nmOe0-WD0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=172e1dada63d1089ce80d258feb473b7",
        "epub": "http://gen.lib.rus.ec/get.php?md5=da9310d5a347c879e09126630a72a5d7",
        "pdf": false,
        "_locals": {}
    },
    "y4nmOe0-WD0C": {
        "id": "y4nmOe0-WD0C",
        "title": "This Is a Book",
        "author": [
            "Demetri Martin"
        ],
        "publisher": "Grand Central Publishing",
        "publishedDate": "2011-04-25",
        "pages": 288,
        "rating": 3.5,
        "description": "From the renowned comedian, creator, star and executive producer/multiple title-holder of Comedy Central's Important Things with Demetri Martin comes a bold, original, and rectangular kind of humor book. Demetri's first literary foray features longer-form essays and conceptual pieces (such as Protagonists' Hospital, a melodrama about the clinic doctors who treat only the flesh wounds and minor head scratches of Hollywood action heroes), as well as his trademark charts, doodles, drawings, one-liners, and lists (i.e., the world views of optimists, pessimists and contortionists), Martin's material is varied, but his unique voice and brilliant mind will keep readers in stitches from beginning to end.",
        "image": "http://books.google.com/books/content?id=y4nmOe0-WD0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://gen.lib.rus.ec/get.php?md5=172e1dada63d1089ce80d258feb473b7",
        "epub": "http://gen.lib.rus.ec/get.php?md5=da9310d5a347c879e09126630a72a5d7",
        "pdf": false,
        "_locals": {}
    },
    "S85NCwAAQBAJ": {
        "id": "S85NCwAAQBAJ",
        "title": "It",
        "author": [
            "Stephen King"
        ],
        "publisher": "Simon and Schuster",
        "publishedDate": "2016-01-05",
        "pages": 1168,
        "rating": 4,
        "description": "They were seven teenagers when they first stumbled upon the horror. Now they were grown-up men and women who had gone out into the big world to gain success and happiness. But none of them could withstand the force that drew them back to Derry, Maine to face the nightmare without an end, and the evil without a name.",
        "image": "http://books.google.com/books/content?id=S85NCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=5c5cf944f533d82c343059d6db9ed243"
    },
    "YhB5y0vAQQEC": {
        "id": "YhB5y0vAQQEC",
        "title": "Barack, Inc.",
        "author": [
            "Barry Libert",
            "Rick Faulk"
        ],
        "publisher": "FT Press",
        "publishedDate": "2009-01-05",
        "pages": 192,
        "rating": 3,
        "description": "Barack Obama's campaign didn't just make history: it teaches lessons that every business can profit from. The Obama campaign was brilliantly planned, strategized, and executed, and built to drive home a powerful, consistent core value proposition: the proposition of change. Moreover, it had an extraordinary understanding of innovation, manifested by its extraordinary use of technology to achieve specific, quantifiable goals. In Barack, Inc., Barry Libert and Rick Faulk present the Obama campaign as a business, identifying lessons any business leader can use to maximize performance. Libert and Faulk cover issues ranging from marketing to leadership, strategy to execution. They reveal how Obama's team identified and honed a powerful core message, and applied it flexibly in response to changing circumstances without ever compromising core brand values. You'll discover how Obama built a focused, \"no-drama\" organization that empowered local decision-makers without sacrificing nationwide consistency or discipline. Finally, the authors, executives at the world's leading provider of business social networking services, show how Obama leveraged social networking at a scale unprecedented in the history of either politics or business. From start to finish, Barack, Inc. is actionable: packed with ready-to-use strategies and tactics that can help you succeed with any goal, in any marketplace.",
        "image": "http://books.google.com/books/content?id=YhB5y0vAQQEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://gen.lib.rus.ec/get.php?md5=5e1cfd9eb7f242bebf152213f1377bc0"
    }
}