{
    "eASACwAAQBAJ": {
        "title": "Computer Vision for the Web",
        "author": [
            "Foat Akhmadeev"
        ],
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2015-10-14",
        "pages": 116,
        "description": "Unleash the power of the Computer Vision algorithms in JavaScript to develop vision-enabled web content About This Book Explore the exciting world of image processing, and face and gesture recognition, and implement them in your website Develop wonderful web projects to implement Computer Vision algorithms in an effective way A fast-paced guide to help you deal with real-world Computer Vision applications using JavaScript libraries Who This Book Is For If you have an interest in Computer Vision or wish to apply Computer Vision algorithms such as face, custom object, and gesture recognition for an online application, then this book is ideal for you. Prior understanding of the JavaScript language and core mathematical concepts is recommended. What You Will Learn Apply complex Computer Vision algorithms in your applications using JavaScript Put together different JavaScript libraries to discover objects in photos Get to grips with developing simple computer vision applications on your own Understand when and why you should use different computer vision methods Apply various image filters to images and videos Recognize and track many different objects, including face and face particles using powerful face recognition algorithms Explore ways to control your browser without touching the mouse or keyboard In Detail JavaScript is a dynamic and prototype-based programming language supported by every browser today. JavaScript libraries boast outstanding functionalities that enable you to furnish your own Computer Vision projects, making it easier to develop JavaScript–based applications, especially for web-centric technologies. It makes the implementation of Computer Vision algorithms easier as it supports scheme-based functional programming. This book will give you an insight into controlling your applications with gestures and head motion and readying them for the web. Packed with real-world tasks, it begins with a walkthrough of the basic concepts of Computer Vision that the JavaScript world offers us, and you'll implement various powerful algorithms in your own online application. Then, we move on to a comprehensive analysis of JavaScript functions and their applications. Furthermore, the book will show you how to implement filters and image segmentation, and use tracking.js and jsfeat libraries to convert your browser into Photoshop. Subjects such as object and custom detection, feature extraction, and object matching are covered to help you find an object in a photo. You will see how a complex object such as a face can be recognized by a browser as you move toward the end of the book. Finally, you will focus on algorithms to create a human interface. By the end of this book, you will be familiarized with the application of complex Computer Vision algorithms to develop your own applications, without spending much time learning sophisticated theory. Style and approach This book is an easy-to-follow project-based guide that throws you directly into the excitement of the Computer Vision theme. A “more in less” approach is followed by important concepts explained in a to-the-point, easy-to-understand manner.",
        "image": "http://books.google.com/books/content?id=eASACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://libgen.io/get.php?md5=867bff4b279097a7ebc163cc49b2fb41",
        "pdf": false
    },
    "wIgSDQAAQBAJ": {
        "title": "Computer Security – ESORICS 2016",
        "author": [
            "Ioannis Askoxylakis",
            "Sotiris Ioannidis",
            "Sokratis Katsikas",
            "Catherine Meadows"
        ],
        "publisher": "Springer",
        "publishedDate": "2016-09-14",
        "pages": 623,
        "description": "The two-volume set, LNCS 9878 and 9879 constitutes the refereed proceedings of the 21st European Symposium on Research in Computer Security, ESORICS 2016, held in Heraklion, Greece, in September 2016. The 60 revised full papers presented were carefully reviewed and selected from 285 submissions. The papers cover a wide range of topics in security and privacy, including data protection: systems security, network security, access control, authentication, and security in such emerging areas as cloud computing, cyber-physical systems, and the Internet of Things.",
        "image": "http://books.google.com/books/content?id=wIgSDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=94acd2272776f781dae78396ee691074"
    }
}    "J8ahqXjUhAAC": {
        "title": "Ready Player One",
        "author": [
            "Ernest Cline"
        ],
        "publisher": "Crown Pub",
        "publishedDate": "2011",
        "pages": 374,
        "rating": 4,
        "description": "Immersing himself in a mid-21st-century technological virtual utopia to escape an ugly real world of famine, poverty and disease, Wade Watts joins an increasingly violent effort to solve a series of puzzles by the virtual world's super-wealthy creator, who has promised that the winner will be his heir. (This book was previously listed in Forecast.)",
        "image": "http://books.google.com/books/content?id=J8ahqXjUhAAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://libgen.io/get.php?md5=7661fbc8dbe9c328ee916ffcaa1203b1",
        "epub": "http://libgen.io/get.php?md5=095812c4a3af9a861c72588c23cc41cc",
        "pdf": "http://libgen.io/get.php?md5=c170bc4cd68d31920b0ded1f68cd7fd8"
    }
}