{
    "ycTADgAAQBAJ": {
        "id": "ycTADgAAQBAJ",
        "title": "Learning React",
        "author": "Alex Banks",
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2017-04-27",
        "pages": 350,
        "description": "If you want to learn how to build efficient user interfaces with React, this is your book. Authors Alex Banks and Eve Porcello show you how to create UIs with this small JavaScript library that can deftly display data changes on large-scale, data-driven websites without page reloads. Along the way, you’ll learn how to work with functional programming and the latest ECMAScript features. Developed by Facebook, and used by companies including Netflix, Walmart, and The New York Times for large parts of their web interfaces, React is quickly growing in use. By learning how to build React components with this hands-on guide, you’ll fully understand how useful React can be in your organization. Learn key functional programming concepts with JavaScript Peek under the hood to understand how React runs in the browser Create application presentation layers by mounting and composing React components Use component trees to manage data and reduce the time you spend debugging applications Explore React’s component lifecycle and use it to load data and improve UI performance Use a routing solution for browser history, bookmarks, and other features of single-page applications Learn how to structure React applications with servers in mind",
        "image": "http://books.google.com/books/content?id=ycTADgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=0f645596d95580dbf816a038fc2018cd",
        "cache": true
    },
    "NZCKCgAAQBAJ": {
        "id": "NZCKCgAAQBAJ",
        "title": "Introduction to React",
        "author": "Cory Gackenheimer",
        "publisher": "Apress",
        "publishedDate": "2015-09-11",
        "pages": 129,
        "description": "Introduction to React teaches you React, the JavaScript framework created by developers at Facebook, to solve the problem of building complex user interfaces in a consistent and maintainable way. React.js shrugs away common front-end conventions in an effort to make things more efficient - use Introduction to React to learn about this framework and more today. Get to know the React API and it’s specific JavaScript extension, JSX, which makes authoring React components easier and maintainable. You will also learn how to test your React applications and about the tools you can use while building. Once you understand these core concepts, you can build applications with React. This will help you cement the ideas and fundamentals of React and prepare you to utilize React in your own use case. What You'll Learn: How to use React to maintain complex user interfaces in an efficient way How to integrate existing user interfaces and move forward with React How to manage application architecture using Flux How to easily utilize JSX, React's JavaScript extension",
        "image": "http://books.google.com/books/content?id=NZCKCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=9927ee0c43532691bfe486ed4a21a2e6",
        "cache": true
    },
    "ZKtPCwAAQBAJ": {
        "id": "ZKtPCwAAQBAJ",
        "title": "React Native for iOS Development",
        "author": "Akshat Paul",
        "publisher": "Apress",
        "publishedDate": "2015-12-31",
        "pages": 171,
        "description": "React Native for iOS Development is your hands-on guide to developing native iOS apps with ease. React Native challenges the status quo of native iOS development with revolutionary components, asynchronous execution, unique methods for touch handling, and much more. React Native eliminates the need for Objective-C and instead uses the power of JavaScript and React to build excellent native apps. You will begin by understanding the path breaking concepts of React.js, which makes it distinctive. You will set up React Native and begin exploring the anatomy of React Native apps. You’ll also learn about flux architecture, how it differs from MVC, and how you can include it in your React Native project to solve problems differently and efficiently. Next, you will learn to create stunning user interfaces and interact with various device capabilities. You will then boost your development by including some popular packages already developed by the React Native community that will helps you write less but do more. Finally, you’ll learn to how write test cases and submit your application to App Store. Using real-world examples with an example-driven approach, you will learn by doing and have a substantial running app at the end of each chapter. Start using React Native for your iOS development using this book today.",
        "image": "http://books.google.com/books/content?id=ZKtPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=9512dae7da7e9e058274da7f3879e3cb"
    },
    "vSLlCwAAQBAJ": {
        "id": "vSLlCwAAQBAJ",
        "title": "Getting Started with React Native",
        "author": "Ethan Holmes",
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2015-12-18",
        "pages": 172,
        "description": "Learn to build modern native iOS and Android applications using JavaScript and the incredible power of React About This Book Learn to design and build a fully-featured application using the newest cutting-edge framework from Facebook Leverage your JavaScript skills to become a native app developer Develop custom UI components, implement smooth navigation, and access native features such as geolocation and local storage Who This Book Is For This book is for web developers who want to learn to build fast, good-looking, native mobile applications using the skills they already have. If you already have some JavaScript knowledge or are using React on the web, then you will be able to quickly get up and running with React Native for iOS and Android. What You Will Learn Set up the React Native environment on both devices and emulators Gain an in-depth understanding of how React Native works behind the scenes Write your own custom native UI components Learn the ins and outs of screen navigation Master the art of layout and styles Work with device-exclusive data such as geolocation Develop native modules in Objective-C and Java that interact with JavaScript Test and deploy your application for a production-ready environment In Detail React Native is a game-changing approach to hybrid mobile development. Web developers can leverage their existing skills to write mobile applications in JavaScript that are truly native without using cross-compilation or web views. These applications have all of the advantages of those written in Objective-C or Java, combined with the rapid development cycle that JavaScript developers are accustomed to. Web developers who want to develop native mobile applications face a high barrier to entry, because they are forced to learn platform-specific languages and frameworks. Numerous hybrid technologies have tried to simplify this process, but have failed to achieve the performance and appearance that users expect. This book will show you all the advantages of true native development that React Native has without the steep learning curve, leveraging the knowledge you already have. We do this by getting you up and running quickly with a sample application. Next, we'll introduce you to the fundamentals of creating components and explain how React Native works under the hood. Once you have established a solid foundation, you will dive headfirst into developing a real-world application from start to finish. Along the way, we will demonstrate how to create multiple screens and navigate between them,use layout and style native UI components, and access native APIs such as local storage and geolocation. Finally, we tackle the advanced topic of Native modules, which demonstrates that there are truly no limits to what you can do with React Native. Style and approach This book provides a simple and easy way to build mobile applications in JavaScript. Each topic takes you through the life cycle of creating a fully-functional native app, with detailed explanations of the entire process.",
        "image": "http://books.google.com/books/content?id=vSLlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=8ea474efe84c0f2e7c6a5e916f6531dc",
        "cache": true
    },
    "Ht3JDAAAQBAJ": {
        "id": "Ht3JDAAAQBAJ",
        "title": "ReactJS by Example - Building Modern Web Applications with React",
        "author": "Vipul A M",
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2016-04-21",
        "pages": 280,
        "description": "Get up and running with ReactJS by developing five cutting-edge and responsive projects About This Book Create pragmatic real-world applications while learning React and its modern developer tools Build sustainable user interfaces by transforming data into components of UI Learn how to generate reusable ReactJS components effectively Who This Book Is For If you are a web developer and wish to learn ReactJS from scratch, then this book is tailor-made for you. Good understanding of Javascript, HTML, and CSS is expected. What You Will Learn Create, reuse, and compose React components using JSX Share data between various React components and techniques for data flow within a React app Handle user interactions with the help of event handlers and dynamic components Set up and use various next generation ES2015/ES6 features with React Understand the performance and immutability features of React using React add-ons Learn the techniques of Animation in React Use data stores to store model-related data and information Create a flux-based React application by using Reflux library In Detail ReactJS is an open-source JavaScript library that brings the power of reactive programming to web applications and sites. It aims to address the challenges encountered in developing single-page applications, and is intended to help developers build large, easily scalable and changing web apps. Starting with a project on Open Library API, you will be introduced to React and JSX before moving on to learning about the life cycle of a React component. In the second project, building a multi-step wizard form, you will learn about composite dynamic components and perform DOM actions. You will also learn about building a fast search engine by exploring server-side rendering in the third project on a search engine application. Next, you will build a simple frontpage for an e-commerce app in the fourth project by using data models and React add-ons. In the final project you will develop a complete social media tracker by using the flux way of defining React apps and know about the best practices and use cases with the help of ES6 and redux. By the end of this book, you will not only have a good understanding of ReactJS but will also have built your very own responsive frontend applications from scratch. Style and approach An easy-to-follow program to learn ReactJS with the help of real world projects. Each topic is explained within the context of a project and provides plenty of tips and tricks for using ReactJS.",
        "image": "http://books.google.com/books/content?id=Ht3JDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": "http://libgen.io/get.php?md5=358a0897031a9761029cec654cca3cc2",
        "epub": "http://libgen.io/get.php?md5=b5a25aa2a02a14cf60f32ae6c400d782",
        "pdf": "http://libgen.io/get.php?md5=8f2479becdd3b0fbc75db1735db78dc5",
        "cache": true
    },
    "Rhl1CgAAQBAJ": {
        "id": "Rhl1CgAAQBAJ",
        "title": "React.js Essentials",
        "author": "Artemij Fedosejev",
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2015-08-27",
        "pages": 208,
        "description": "A fast-paced guide to designing and building scalable and maintainable web apps with React.js About This Book Build maintainable and performant user interfaces for your web applications using React.js Create reusable React.js components to save time and effort in maintaining your user interfaces Learn how to build a ready-to-deploy React.js web application, following our step-by-step tutorial Who This Book Is For If you're a front-end developer with knowledge of jQuery and its libraries, along with frameworks, such as Angular.JS and Backbone.JS, or native JavaScript development, and you wish to use the fastest web user interface library there is, then this book is ideal for you. What You Will Learn Install powerful React.js tools to make development much more efficient Create React elements with properties and children Get started with stateless and stateful React components Use JSX to speed up your React.js development process Add reactivity to your React components with lifecycle methods Integrate your React components with other JavaScript libraries Utilize the Flux application architecture with your React components Test your React components with Jest test framework In Detail Building web applications with maintainable and performant user interfaces is a challenge that many have faced for more than a decade, but no one has risen to this challenge quite like React.js. Today React.js is used by Facebook, Instagram, Khan Academy, and Imperial College London, to name a few. Many new users recognize the benefits of React.js and adopt it in their own projects, forming a fast-growing community. The speed at which React.js has evolved promises a bright future for those who invest in learning it today. React.js Essentials will take you on a fast-paced journey through building your own maintainable React.js application. Begin by exploring how you can create single and multiple user interface elements. Create stateless and stateful components and make them reactive, learn to interact between your components and lifecycle methods and gauge how to effectively integrate your user interface components with other JavaScript libraries. Delve deep into the core elements of the Flux architecture and learn how to manage your application using stores. Finish by going that extra mile with the Jest test framework, running multiple tests on your application and find solutions to scale it further without complexity. Style and approach The book adopts a step-by-step, hands-on approach with ample codes to ensure you learn React.js at a fast pace.",
        "image": "http://books.google.com/books/content?id=Rhl1CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": "http://libgen.io/get.php?md5=b087cd3935de6fc5cdafa0b63c11e77c",
        "pdf": "http://libgen.io/get.php?md5=04d7e6f328d5ed5213d7c1634862e12e",
        "cache": true
    },
    "47FKDAAAQBAJ": {
        "id": "47FKDAAAQBAJ",
        "title": "Mastering React",
        "author": "Adam Horton",
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2016-02-23",
        "pages": 254,
        "description": "Master the art of building modern web applications using React About This Book Write a complete application in React using an array of supporting libraries, both specifically React-related and general purpose Understand what makes React stand apart from the vast majority of JS frameworks available through detailed explanations and concise examples Explore the React ecosystem and how to integrate React with other modern web technologies Who This Book Is For This book is ideal for web developers possessing strong core JavaScript fundamentals who are also interested in learning what React brings to the architectural table. Previous experience with React or other web frameworks isn't required, but may help. What You Will Learn Understand the React component lifecycle and core concepts such as props and states Craft forms and implement form validation patterns using React Explore the anatomy of a modern single-page web application Develop an approach for choosing and combining web technologies without being paralyzed by the options available Create a complete single-page application Start coding with a plan using an application design process Add to your arsenal of prototyping techniques and tools Make your React application feel great using animations In Detail React stands out in the web framework crowd through its approach to composition. This approach yields blazingly fast rendering capabilities. This book will help you understand what makes React special. It starts with the fundamentals and uses a pragmatic approach, focusing on clear development goals. You'll learn how to combine many web technologies surrounding React into a complete set for constructing a modern web application. With this text, you'll blitz the basics then swiftly move on to advanced topics such as form validation and complete application construction. You'll also explore several design activities which will help you develop your web applications with a thoughtful plan. Finally, you'll learn several methods for implementing slick animations using React. Style and approach This is a comprehensive, hands-on guide that helps you get a solid understanding of the ins and outs of React development. For application development, you will get a high view of the anatomy where you will zoom into each part and make decisions by moving through the application's anatomy; selecting a solution that fits the problem and lines up with your goals.",
        "image": "http://books.google.com/books/content?id=47FKDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "mobi": false,
        "epub": false,
        "pdf": "http://libgen.io/get.php?md5=330af1c83969f2c470e3ab5a5d024f77"
    }
}